[
  {
    "URL":"https:\/\/www.yahoo.com\/news\/beverly-road-sinkhole-causes-road-204334214.html",
    "Date":"2025-07-06 23:00:00",
    "News_title":"WVDOH drafting plans to fix Fairmont sinkhole",
    "News_text":"UPDATE (7\/7\/25) —The West Virginia Division of Highways has put out a press release with what they plan to do about the sinkhole that is currently impacting Beverly Road in Marion County.\n\nThe full release can be read below:\n\nThe West Virginia Division of Highways (WVDOH) is drawing up plans to repair a sinkhole that opened on Beverly Road in Fairmont.WVDOH engineers had been working with officials in Fairmont to address an existing sinkhole that closed Beverly Road, but an additional sinkhole opened over the past few days.WVDOH work crews will install concrete barriers on US 250 to divert traffic from the sinkhole and completely close Beverly Road until the sinkhole can be repaired. WVDOH engineers are currently designing a project to replace the storm sewer that led to the sinkholes opening.\n\nWest Virginia Division of Highways\n\nORIGINAL:FAIRMONT, W.Va. (WBOY) — Beverly Road and an additional lane of Fairmont Avenue has been closed due to a sinkhole caused by theFather’s Day Floodback in June, which appears to be growing worse.\n\nA 12 News reporter traveled to the intersection ofBeverly Road and Fairmont Avenue and captured up to date photos of the sinkhole. It was also noted that Beverly Road was closed along with a lane of Fairmont Avenue.\n\nOne person transported from Morgantown apartment fire\n\n12 News reached out to the West Virginia Division of Highways and the City of Fairmont for additional information on June 23. The city responded with the following statement:\n\nThat area at the intersection of 250 with Beverly Road was impacted significantly by the recent flood event. That falls within the WVDOH right-of-way and we are working with them to come to a solution. As you can imagine, our crews, as well as DOH crews, are stretched thin addressing the carnage around Marion County.\n\nCity of Fairmont\n\n12 News has again reached out to the WVDOH for additional information. As of publication, theWV511 websiteshows that the sinkhole only impacted one lane of Beverly Road, but it was last update on June 20.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WBOY.com.",
    "Atomic_Facts":"[\"The West Virginia Division of Highways announced on July 7, 2025, that they are drafting plans to repair a sinkhole that has closed Beverly Road in Fairmont, West Virginia, and will install concrete barriers on US 250 to divert traffic.\", \"An additional sinkhole opened on Beverly Road in Fairmont, West Virginia, over the past few days, prompting the West Virginia Division of Highways to design a project to replace the storm sewer that caused the sinkholes.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/state-repair-fairmont-sinkhole-cropped-224600386.html",
    "Date":"2025-07-07 23:30:00",
    "News_title":"State to repair Fairmont sinkhole that cropped up after June floods",
    "News_text":"CHARLESTON — The West Virginia Division of Highways is drawing up plans to repair a sinkhole that opened on Beverly Road in Fairmont.\n\nWVDOH engineers had been working with officials in Fairmont to address an existing sinkhole that closed Beverly Road, but an additional sinkhole opened over the past few days, according to a press release.\n\nOfficials did not give any information on when the work will begin or long the repair project will take.\n\nWVDOH work crews will install concrete barriers on US 250 South to divert traffic from the sinkhole. Crews will also completely close Beverly Road until the sinkhole can be repaired. WVDOH engineers are currently designing a project to replace the storm sewer that led to the sinkholes opening.",
    "Atomic_Facts":"[\"The West Virginia Division of Highways announced on July 7, 2025, that it will completely close Beverly Road in Fairmont to repair a newly opened sinkhole, while also installing concrete barriers on US 250 South to divert traffic.\", \"WVDOH engineers are currently designing a project to replace the storm sewer that caused the sinkholes on Beverly Road in Fairmont.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/hyco-river-flooding-closes-roads-143530786.html",
    "Date":"2025-07-08 16:45:00",
    "News_title":"Hyco River flooding closes roads in Halifax County",
    "News_text":"HALIFAX COUNTY, Va. (WFXR) – The Virginia Department of Transportation is reporting the Hyco River has flooded, impacting two roadways in three different places. Detours are in place, said officials in a release.\n\nA section of Route 501, also known as the Huell Matthews Highway, near Virginilina Road, is flooded. A second section of Route 96 roadway is also closed due to flooding. The following detour is in place, said VDOT:\n\nTake Route 58 East toward Sandy Fork\n\nTurn Right onto Route 49\n\nContinue on Route 49 into North Carolina to connect to Route 501 near Roxboro\n\nSinkhole closes road in Giles County\n\nFurther West, parts of Route 58 are closed between Calvary Road and Wilkins Road due to a sinkhole, according to officials. The agency said drivers can take the following detour:\n\nRight on Route 119\n\nCross the North Carolina state line\n\nMake a left on William Barker Road\n\nMake a left onto Cunningham Road\n\nContinue on Route 699 back to Route 58\n\n(Photo Credit: The Virginia Department of Transportation)\n\nThese will be long-term closures, warned VDOT officials in a release. The agency will share more about the timeline for getting the roads back open later. WFXR News will bring you that update on air and online.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WFXRtv.",
    "Atomic_Facts":"[\"The Virginia Department of Transportation reported on July 8, 2025, that the Hyco River has flooded, impacting Route 501 near Virginilina Road and Route 96, with detours in place for affected drivers.\", \"VDOT officials warned that the road closures due to flooding in Halifax County will be long-term, with further updates on the timeline for reopening expected to be shared later.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/traffic-advisory-sinkhole-reported-orange-192202341.html",
    "Date":"2025-07-08 21:00:00",
    "News_title":"Traffic Advisory: Sinkhole reported on Orange County road",
    "News_text":"A sinkhole has appeared on Conway Road near Conway and Hoffner, causing parts of the road to be shut down and traffic to be rerouted.\n\nOrange County deputies are blocking off the area because of the sinkhole in one of the northbound lanes of Conway Road. Though the sinkhole is described as small, it is very deep, leading officials to reroute traffic through nearby business parking lots to keep everyone safe.\n\nA deputy on scene noted that the sinkhole is small yet very deep, and precautions are in place to prevent vehicles from approaching it. Due to its depth, traffic has been rerouted, with local businesses serving as alternate routes, possibly causing temporary disruptions.\n\nAuthorities are actively managing the situation to minimize the impact.\n\nThe situation is ongoing, with deputies actively managing traffic and ensuring public safety around the affected area on Conway Road.\n\nClick hereto download our free news, weather and smart TV apps. Andclick hereto stream Channel 9 Eyewitness News live.",
    "Atomic_Facts":"[\"A sinkhole appeared on Conway Road near Conway and Hoffner in Orange County on July 8, 2025, causing parts of the road to be shut down and traffic to be rerouted through nearby business parking lots.\", \"Orange County deputies are blocking off the area around the sinkhole in one of the northbound lanes of Conway Road, implementing precautions to prevent vehicles from approaching due to its significant depth.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/epso-man-safely-arrested-mental-221139391.html",
    "Date":"2025-07-09 00:45:00",
    "News_title":"EPSO: Man safely arrested after mental health episode",
    "News_text":"(EL PASO COUNTY, COLO.) — A man was safely taken into custody after he allegedly caused thousands of dollars worth of property damage and was found bathing in a sinkhole during an apparent mental health episode.\n\nAccording to EPSO, around 7 a.m. on Friday, June 27, deputies responded to the area of Air Lane northeast of Peterson Space Force Base on a report of criminal mischief. The suspect, identified as 36-year-old David Whitcomb, allegedly caused over $2,000 in property damage during an apparent mental health episode.\n\nWhen deputies arrived on scene, EPSO said Whitcomb was no longer in the area. Deputies were reportedly already familiar with Whitcomb due to a prior arrest on June 21 for felony menacing. During that incident, Whitcomb was allegedly armed with knives and refused to cooperate with deputies.\n\nShortly before 8:45 a.m. on June 27, dispatchers received another call reporting a man bathing in a rain-filled sinkhole along Preble Drive. The description of the man matched that of Whitcomb, EPSO said. When deputies arrived, they found Whitcomb standing in the water, refusing to following commands.\n\nDeputies had to set up a perimeter and tried to use several rounds of less-lethal pepper balls, but EPSO said those attempts were not effective. Deputies made a second attempt, during which Whitcomb tried to run away. After a physical struggle in the water, Whitcomb was safely taken into custody.\n\n“This was a highly unpredictable situation involving an individual in crisis. My deputies showed professionalism, restraint, and commitment to preserving life while ensuring the safety of the community,” said El Paso County Sheriff Joseph Roybal. “I commend them for resolving this incident without serious injury to anyone involved.”\n\nWhitcomb was booked into the El Paso County Jail on multiple charges, including attempted second degree burglary, felony criminal mischief, first degree criminal trespass, resisting arrest, and obstructing a peace officer. He is being held on a $2,000 bond.\n\n“My Detention staff will ensure Mr. Whitcomb will be evaluated and provided mental health services while in our care,” said Sheriff Roybal.\n\nIf you or someone you know is struggling with mental health, help is available. Call or text 988 to connect with the Suicide & Crisis Lifeline; this service provides 24\/7 confidential support for anyone in crisis or emotional distress.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to FOX21 News Colorado.",
    "Atomic_Facts":"[\"David Whitcomb, a 36-year-old man, was arrested on June 27, 2025, after allegedly causing over $2,000 in property damage and was found bathing in a sinkhole near Preble Drive in El Paso County, Colorado.\", \"Whitcomb was booked into the El Paso County Jail on multiple charges, including attempted second degree burglary and felony criminal mischief, and is being held on a $2,000 bond.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/newport-secures-11-million-cliff-170118473.html",
    "Date":"2025-07-10 20:00:00",
    "News_title":"Newport secures $11 million for Cliff Walk repairs",
    "News_text":"NEWPORT, R.I. (WPRI) — Newport is getting a significant funding package to help preserve and restore the iconicCliff Walk.\n\nThe City by the Sea applied for federal assistance through the Promoting Resilient Operations for Transformative, Efficient and Cost-Saving Transportation (PROTECT) program and was granted $11 million.\n\nThe grant, which is believed to be the largest single federal grant ever awarded to Newport, brings the total funding for the project to $22 million:\n\n$11 million from the PROTECT grant\n\n$5 million Congressional earmark included in the Fiscal Year 2024 Consolidated Appropriations Act\n\n$3 million from State Green Bond proceeds\n\n$3.75 million from the city’s 2024 General Obligation Bond approved by voters in November\n\nAll of the funding will support infrastructure repairs and improvements, enhance Cliff Walk’s coastal resilience, and ensure continued public access, according to the city.\n\nBACKGROUND: Another section of Newport Cliff Walk collapses\n\nNow, the city can begin working with the U.S. Department of Transportation and the Federal Highway Administration’s Providence office.\n\nLast year, a portion of Cliff Walk’s southern end was temporarilyclosed after a resident discovered a sinkholein the raised concrete walkway behind Miramar.\n\nThe city also blocked offa lengthy stretchof the historic landmark in 2022 after the pathway crumbled onto the beach below. Engineers believe erosion was to blame for the collapse since it appeared the land beneath the path gave way.\n\nCliff Walk draws an estimated one million visitors each year.\n\nDownload theWPRI 12andPinpoint Weather 12apps to get breaking news and weather alerts.\n\nWatch12 News Now on WPRI.comor with the new12+ smart TV app.\n\nFollow us on social media:\n\nClose\n\nThanks for signing up!\n\nWatch for us in your inbox.\n\nSubscribe Now\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WPRI.com.",
    "Atomic_Facts":"[\"Newport, Rhode Island, has been awarded an $11 million federal grant through the PROTECT program to support the preservation and restoration of the Cliff Walk, marking the largest single federal grant ever received by the city.\", \"The total funding for the Cliff Walk project now amounts to $22 million, which includes $5 million from a Congressional earmark, $3 million from State Green Bond proceeds, and $3.75 million from the city's 2024 General Obligation Bond approved by voters in November 2024.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/first-responders-continue-help-clear-103845941.html",
    "Date":"2025-07-11 13:15:00",
    "News_title":"First responders continue to help clear roads throughout Halifax County",
    "News_text":"HALIFAX COUNTY, Va. (WFXR)- It’s been a rough week in Southside, as many Virginia localities have been slammed with flooding and rain. That led to several road closures in the area.\n\nOfficials in Halifax County went as far as to call the rainfall unprecedented.\n\n“We’ve never seen flooding like this in this particular part of the county,” First Sergeant Christopher Owens, with Virginia State Police’s Bureau of Field Operations Division III Area 23, said. “We were able to handle routine calls for service with our normal patrol operations, but we did have to bring in our search and recovery team.”\n\nCrews rescue multiple drivers in Halifax County flooding\n\nFlooding from nearby rivers and even a sinkhole have made travel in the area difficult.\n\nHowever, first responders have been hard at work cleaning up the roads and have reopened several.\n\n“We’ve had great communication and great cooperation with sister agencies,” Brian Conner, the Halifax County emergency medical services (EMS) supervisor, said. “We’ve had help from Virginia State Police, and with the two local fire departments in that affected area, Cluster Springs and Virgilina, working together and it’s been a great effort.”\n\nDespite the progress, there are still road closures throughout the area as the water is still in the process of receding.\n\nBoth state police and County emergency management urge drivers to obey the signs and turn around, don’t drown.\n\nHalifax County Sheriff’s Office releases update on road closures\n\n“If you do come upon standing water in a roadway, don’t chance it,” First Sergeant Owens said. “Please respect and adhere to any posted barricades or signage saying the roads are closed due to high water.”\n\n“We don’t know what the roads are like under the water, so we don’t know if the roads are washed out under the water or not,” Conner added. “Until the water recedes, we won’t know.”\n\nOfficials hope to get all the roads reopened sometime this weekend.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WFXRtv.",
    "Atomic_Facts":"[\"Halifax County officials reported unprecedented flooding on July 11, 2025, leading to multiple road closures and the activation of a search and recovery team by the Virginia State Police.\", \"Emergency responders in Halifax County, including the Virginia State Police and local fire departments from Cluster Springs and Virgilina, have reopened several roads, but some closures remain as water continues to recede.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/sinkhole-wilkes-barre-evacuates-homes-173508025.html",
    "Date":"2025-07-14 20:15:00",
    "News_title":"New sinkhole in Wilkes-Barre evacuates homes",
    "News_text":"WILKES-BARRE, LUZERNE COUNTY(WBRE\/WYOU) —A new sinkhole opened up in Wilkes-Barre Monday morning, causing many families to be evacuated.\n\nHorton Street in Wilkes-Barre might have some bad luck when it comes to sinkholes.\n\nJust a few weeks ago, the road was shut down due to a sinkhole caused by stormwater backup; now, it’s closed again.\n\n“This is a new sinkhole. We still have the one that opened up at the end of June, and we’re still working on that sinkhole. This is in addition to that one,” stated Mayor of Wilkes-Barre, George Brown.\n\nPeople living nearby evacuated when crews were called to a possible gas leak, and the owner of a Horton Street business told us he wasn’t open for long today.\n\nRoads closures due to flooding in central Pa.\n\n“We were open for business, as of 9 am, the water was shut off. Shortly after that, they came to check the building for a gas leak. As we were walking through the building, they determined it wasn’t in the building. By the time we walked to the front of the building, they had cut the power. The gas leak started a sinkhole that opened up behind the building, and we had to evacuate,” explained Scott Paull, owner of Wet Paint Printing + Design.\n\nWhile crews aren’t sure of the cause, Mayor Brown told us what they know so far.\n\n“We believe it’s the fence of the American water line that blew, that took out the gas line. So now, we’re in the process of turning off the gas to make sure that we can get in there and identify what other areas have to be replaced. Is it the sewer lines, storm water, we know the gas, and we know the water lines,” expressed Mayor Brown.\n\nEven though this isn’t the first sinkhole on Horton Street, this is the first time Paull’s business was affected\n\n“Today, you know, this is the first time we’re completely closed, and we’re not going to get our shipments out for the day, there’s no pick-up, no UPS drop-off. We’re closed,” said Paull.\n\nPaull tells us he’s not too upset about the day off..\n\n“I’m not so concerned, I would love to have my business open, but there are residents on the street that I believe are more prioritized. They’re not in their homes, I can go home tonight, and I’ll have power, they won’t.”\n\nCrews aren’t able to tell us when the road will be reopened or when the sinkhole will be contained.\n\nThose who had to evacuate will be notified when it is safe to come home.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to 28\/22 News.",
    "Atomic_Facts":"[\"A new sinkhole opened on Horton Street in Wilkes-Barre, Luzerne County, on July 14, 2025, prompting the evacuation of nearby families due to a possible gas leak.\", \"Mayor George Brown stated that the new sinkhole is in addition to another sinkhole that opened at the end of June 2025, and crews are currently investigating the cause, which may involve damaged gas and water lines.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/second-subsidence-impacts-horton-street-192000628.html",
    "Date":"2025-07-14 20:15:00",
    "News_title":"Second subsidence impacts Horton Street in Wilkes-Barre",
    "News_text":"Jul. 14—WILKES-BARRE — Crews from UGI Utilities were rushing to turn off natural gas as a second subsidence occurred on Horton Street Monday morning.\n\nThe subsidence in front of 179 Horton St. and near Roosevelt Street is about 75 yards from a sinkhole that opened June 25.\n\nMark Maley, who lives near the subsidence, said he noticed the road beginning to sink along with a strong odor of natural gas at about 10:30 a.m.\n\nMaley said about 15 minutes after his brother moved a parked Pontiac, the roadway caved-in and natural gas gushed out from underground.\n\nThe electrical grid to the area was shut off as Wilkes-Barre firefighters responded to the scene.\n\n\"If my brother hadn't moved his car, it would have fallen in,\" Maley said.\n\nUGI crews were busy digging a hole adjacent to the subsidence in efforts to find a shut-off valve.\n\nAbout 75 yards away on Horton Street near Carlisle Street, a stormwater line collapsed causing a sinkhole to open on June 25.\n\nHorton Street had been closed since the June 25 incident as the stormwater pipe is being replaced.",
    "Atomic_Facts":"[\"On July 14, 2025, a second subsidence occurred on Horton Street in Wilkes-Barre, approximately 75 yards from a sinkhole that opened on June 25, prompting UGI Utilities to rush to turn off natural gas in the area.\", \"Mark Maley reported that at about 10:30 a.m. on July 14, he noticed the road sinking and a strong odor of natural gas, shortly before the roadway caved in and gas gushed out from underground.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/construction-continues-sink-hole-opened-213945146.html",
    "Date":"2025-07-16 00:00:00",
    "News_title":"Construction continues on sink hole that opened up Monday",
    "News_text":"WILKES-BARRE, LUZERNE COUNTY (WBRE\/WYOU) —28\/22 News now knows more about the second sinkhole that opened up on Monday in Wilkes-Barre, causing evacuations and a street closure.\n\nMonday morning brought rain and another big sinkhole to Horton Street in Wilkes-Barre. Crews were called to the scene for a possible gas leak, and nearby residents were evacuated for their safety.\n\nIn the evening, the people forced to leave were allowed to return.\n\n“They were quickly evacuated away from the area, most of them were with family and friends locally. Then, last evening, when we returned the water service, electrical service to the properties, and when the natural gas was shut off from where the gas line was broken, we allowed them to go back into their properties,” said Chief Jay Delaney from the Wilkes-Barre Fire Department.\n\nConstruction continues today as crews are still working to analyze and repair the issue, but residents are starting to get fed up with the problems on their street.\n\n“It’s just an ongoing inconvenience, I mean, now this is the second part of Horton Street closed on top of the first hole already, so, it’s like, when are you guys going to get this fixed?” said resident Samantha Stoffel.\n\nJ.D. Vance to address “Big Beautiful Bill” in Luzerne County\n\nCars trying to get to the nearby Geisinger South Wilkes-Barre Hospital were detoured on Monday, but Chief Delaney says there are no issues on Tuesday.\n\n“Traffic flow was impeded to the hospital, but late in the afternoon, we made sure Church Street was open, we made sure Roosevelt Terr was open back up, so all access to Geisinger South Wilkes-Barre is fully operational today,” explained Delaney.\n\nThe owner of a Horton Street business says he worries there might be more problems with the street.\n\n“My overall concern is for the infrastructure, and that they are working at it, and I hope nothing else happens, and hopefully it doesn’t rain too heavily this week,” said the owner of Wet Paint Printing, Scott Paull.\n\nWhile crews work to get both sinkholes fixed, residents can expect them to stay for some time.\n\n“I want my street back. I’m used to people coming and going up and down the street, you know, and I don’t even get a lot of company anymore because they don’t know if my road’s closed. It’s just a bad street to have it on,” said Stoffel.\n\nThere is no timeline for when the construction projects will be done.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to 28\/22 News.",
    "Atomic_Facts":"[\"A second sinkhole opened on Horton Street in Wilkes-Barre, Luzerne County on July 15, 2025, prompting evacuations and a street closure due to a possible gas leak.\", \"Traffic flow to Geisinger South Wilkes-Barre Hospital was impeded on July 15, 2025, but by late afternoon, Church Street and Roosevelt Terrace were reopened, restoring full access to the hospital.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/crews-digging-answers-altoona-dealership-213007890.html",
    "Date":"2025-07-18 00:15:00",
    "News_title":"Crews digging for answers in Altoona dealership sinkhole",
    "News_text":"ALTOONA, Pa. (WTAJ) — Crews are digging for answers as to why a sinkhole occurred at an Altoona car dealership Wednesday night.\n\nThe sinkhole appeared at the back end of a car lot at Courtesy Ford off Pleasant Valley Blvd. The hole caused four Kia Sportages to sink into the ground.\n\nThe dealership did not notice the divot until a customer pointed it out to them.\n\n“A customer actually came into the showroom and said, ‘Hey…you have some cars in a sinkhole, and I thought he was kidding,” general sales manager JT Ventura said. “Then we walked out and he wasn’t joking.”\n\nAltoona tenants vacate apartment due to unsafe conditions\n\nThe cars were towed out of the hole with little to no damage. Only one Kia Sportage had a small scrape on the bottom. Once the cars were moved from the hole, they were taken to the inspection shop to be reviewed by technicians. The prices will be adjusted accordingly to these cars if damage is found.\n\nThe other products in the proximity were moved from their spots and placed on the lawn next to Valley View Blvd. This gave crews enough room to tape off the area and dig for answers.\n\n“We have this whole space blocked off,” Ventura added. “But as we dig in, they start to contain the site a little bit more.”\n\nAs of Thursday, crews have not found an answer to the problem. They spent the majority of the day pulling large slabs of concrete and asphalt, metal plates and rubble from the hole.\n\nTheir search revealed a pipe with a puddle of water adjacent. They have not said if the pipe caused the ground to sink.\n\nHowever, Ventura has a theory as to what caused the cars to fall into the hole.\n\n“It was because of the rain,” Ventura said. “The rain that caused the sinkhole to actually go down.”\n\nCrews will continue to dig through the area for answers, but the dealership is making the most out of the situation. Courtesy Ford told WTAJ that they are having a sinkhole sale in honor of the occasion.\n\n“Me and the sales management team, we were here until 10 p.m. slashing all of our prices,” Ventura said.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WTAJ - www.wtaj.com.",
    "Atomic_Facts":"[\"A sinkhole appeared at Courtesy Ford dealership in Altoona, Pennsylvania on July 17, 2025, causing four Kia Sportages to sink into the ground, which were later towed out with minimal damage.\", \"In response to the sinkhole incident, Courtesy Ford announced a \\\"sinkhole sale\\\" on July 18, 2025, where the sales management team worked until 10 p.m. to reduce prices on vehicles.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/something-hadn-t-imagined-kansas-234252091.html",
    "Date":"2025-07-18 02:30:00",
    "News_title":"‘Something we hadn’t imagined’: Kansas reels from storm damage",
    "News_text":"OLATHE, Kan. – Thursday was filled with aggravations in Johnson and Wyandotte counties, as the remnants of Wednesday night’s thunderstorm linger.\n\nHigh water caught up to some drivers on Wednesday night, and as of Thursday afternoon, six cars are still stuck in rising floodwaters near the New Century Commerce Center at S. Clare Road and W. 159thStreet. Johnson County Sheriff’s deputies told FOX4 News they’d prefer that drivers wait until the water fades until they retrieve their cars, but on Thursday, some tow truck drivers tried anyway.\n\n“People drove in and it was too much for their cars,” Johnson County Sheriff Sgt. Ross Turner said.\n\nSgt. Turner said Wednesday evening drivers on Clare Road may not have seen rising waters until they were stuck, since stormy skies were so dark. Sgt. Turner said some drivers waded through the water to safety while others needed rescue.\n\n“The water is deceiving. It’s an optical illusion. You drive in, and you don’t know if the road is washed out or if there’s a change in the roadway. Cars get there, and the engines can’t take the water. If it stops, you’re stuck there while the water overtakes your car,” Sgt. Turner said.\n\nIn Shawnee, FOX4 viewer Caleb Swanon shared drone video with FOX4 News showing a neighborhood creek off Barker Road that’s flooded well past its banks. Neighbors believe it’s the highest they’ve ever seen it.\n\nTo the north in Wyandotte County’s Turner Neighborhood, a large sinkhole is forming across the street from Tajuan Pledger’s home off Metropolitan Avenue. When Wednesday night’s rainfall delivered as much as nine inches of precipitation, water escaped a pond across the road, which, in turn, flooded a a nearby drainage ditch, and then, a chunk of Metropolitan Avenue. Pledger and his family are watching the hole grow, while soil and rock from the ditch flow into his yard and flood the family home.\n\n“What was in store was something we hadn’t imagined,” Pledger explained. “It didn’t just push over water. It pushed over all this debris and all these rocks. That’s all over in the yard as well. It just shows you the power of what the water was doing.”\n\nSgt. Turner also mentioned power as another reason for driver to avoid flooded areas. He said it doesn’t take much water to move a heavy car, and it could be devastating to a person if they challenged the water’s strength.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to FOX 4 Kansas City WDAF-TV | News, Weather, Sports.",
    "Atomic_Facts":"[\"As of Thursday afternoon, July 18, 2025, six cars remain stuck in rising floodwaters near the New Century Commerce Center at S. Clare Road and W. 159th Street in Johnson County, Kansas, following a thunderstorm that delivered up to nine inches of rain.\", \"A large sinkhole is forming across the street from Tajuan Pledger’s home on Metropolitan Avenue in Wyandotte County, Kansas, as a result of flooding from Wednesday night’s rainfall, which caused water to escape a nearby pond and flood a drainage ditch.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/part-university-avenue-morgantown-closed-134911228.html",
    "Date":"2025-07-18 23:00:00",
    "News_title":"Part of University Avenue in Morgantown closed for sinkhole",
    "News_text":"MORGANTOWN, W.Va. (WBOY) — Part of University Avenue in downtown Morgantown will be closed for at least a week while crews repair a section of road affected by a sinkhole.\n\nTheMorgantown Utility Board (MUB) said Thursdaythat the area between Falling Run Road and Stewart Street will be closed starting July 18 and last for a week. Arelease from West Virginia Universitysaid the closure could last until Aug. 1 or later, depending on weather.\n\nAccording to the release, sidewalks in the area will also be closed, but the parking lot at the intersection of University Avenue and Falling Run Road will remain open.\n\nMore parking coming soon for truckers in West Virginia\n\nDrivers who park in Area 5 can access the lot from Campus Drive “through a gap in the road closure signs,” according to the release, or they will be permitted to use the ST-10 lot using their Area 5 permit, the release said.\n\nIn the area where the sinkhole is located over aculvert holding Falling Run, a creek that was moved underground to build the original Mountaineer Field more than 100 years ago. The MUB has not said if the sinkhole is related to the culvert.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WBOY.com.",
    "Atomic_Facts":"[\"Part of University Avenue in downtown Morgantown, West Virginia, will be closed for repairs due to a sinkhole starting July 18, 2025, and the closure is expected to last at least until August 1, 2025, depending on weather conditions.\", \"The Morgantown Utility Board announced that sidewalks in the area between Falling Run Road and Stewart Street will also be closed during the repair work, although the parking lot at the intersection of University Avenue and Falling Run Road will remain open.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/portion-dayton-road-temporarily-closed-194051634.html",
    "Date":"2025-07-18 23:15:00",
    "News_title":"Portion of Dayton road temporarily closed after sinkhole forms",
    "News_text":"DAYTON, Ohio (WDTN) — The formation of a sinkhole is causing a portion of a Dayton road to close.\n\nOne southbound lane of Riverside Drive is closed after a 6 foot by 6 foot sinkhole formed at the intersection of Riverside Drive and Ryburn Avenue.\n\nBoth southbound lanes of Riverside Drive at Siebenthaler Avenue will close roughly after 9 a.m. on July 28. Southbound lanes of Riverside Drive will be closed at Ryburn and Siebenthaler avenues until just before 7 a.m. on July 30.\n\nPolice looking for suspect accused of entering window, stealing cigarettes\n\nAccording to the city, the closure is needed to ensure inspection and repair can be conducted.\n\n“To ensure there are no hidden voids beneath the surface, crews will need to remove additional pavement around the affected area,” said the city.\n\nDayton suggests southbound drivers on Riverside Drive take East Siebenthaler Avenue to North Main Street to East Hillcrest Avenue to Riverside Drive.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WDTN.com.",
    "Atomic_Facts":"[\"One southbound lane of Riverside Drive in Dayton, Ohio, is closed due to a 6 foot by 6 foot sinkhole that formed at the intersection of Riverside Drive and Ryburn Avenue.\", \"Both southbound lanes of Riverside Drive at Siebenthaler Avenue will close at approximately 9 a.m. on July 28, 2025, and will remain closed until just before 7 a.m. on July 30, 2025, for inspection and repair.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/dangerous-sinkhole-shuts-down-part-230700342.html",
    "Date":"2025-07-23 00:00:00",
    "News_title":"‘Dangerous’ sinkhole shuts down part of Monessen roadway",
    "News_text":"Part of a Westmoreland County road is closed because of a dangerous sinkhole.\n\nCity of Monessen Mayor Rob Mozer declared an emergency, closing State Road between Route 906 and Pennsylvania Avenue.\n\nCity officials say the hole, which is about 10 by 15 feet in surface area and between 12 and 15 feet deep, is the result of mine subsidence.\n\n“The hole poses a threat to motorist safety, public works personnel and the general public, and requires immediate action beyond the scope of normal municipal operations,” a news release from city officials said.\n\nEfforts to stabilize and repair the area are already underway.\n\nDownload theFREE WPXI News appfor breaking news alerts.\n\nFollow Channel 11 News onFacebookandTwitter. |Watch WPXI NOW",
    "Atomic_Facts":"[\"Monessen Mayor Rob Mozer declared an emergency on July 23, 2025, closing State Road between Route 906 and Pennsylvania Avenue due to a dangerous sinkhole measuring approximately 10 by 15 feet and between 12 and 15 feet deep, caused by mine subsidence.\", \"City officials stated that the sinkhole poses a threat to motorist safety and requires immediate action beyond normal municipal operations, with efforts to stabilize and repair the area already underway.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/tragedy-flash-flooding-closes-downtown-223508246.html",
    "Date":"2025-07-23 01:30:00",
    "News_title":"“That’s a tragedy”: Flash flooding closes downtown Evansville building",
    "News_text":"EVANSVILLE, Ind. (WEHT) — After a round of flash flooding over the weekend, both Hadi Shrine Temple and Robert’s By The River have temporarily closed it’s doors as owners continue to assess the damages.\n\n“We had between 3-4 inches of water over across the floor, in the offices, and in the the restaurant,” said Hadi Shrine Past Potentate Rick Hubbard. “Some of the drywall is gone and will probably have to be cut out to keep mold from happening.”\n\nBoth Hadi Shrine Temple and Robert’s By The River are no strangers to major downtown inconveniences. Earlier this year, the building was dealt with the closure from the sinkhole on Riverside Drive which blocked a large portion of the building’s entrances\n\n“It’s a start up restaurant for them,” said Hubbard, talking about Robert’s. “And this is not going to help them because they’ve been trying to get through and manage it without any traffic around here. And Riverside being totally closed down, and all the other construction projects around, it’s been slim pickings for them.”\n\nDespite the temple also facing damages, Hubbard shares further concerns for their neighboring business during this time. He says water damages was found along the first floor of the building, which included the entire restaurant.\n\n“They got to rip carpet out, they got to do drywall work, they got to do baseboard work, they got to clean the kitchen, they got to get re-inspected again, they’re going to have to throw away food between now and then,” said Hubbard. “So they’re going to be hurting and for a small business, that’s a tragedy.”\n\nIn the midst of the sinkhole and the flooding, Hubbard stresses the importance of keeping the building in the spotlight in the downtown area.\n\n“We’re trying to make downtown vibrant but we need to get our businesses back here and get them functioning again,” said Hubbard.\n\nAs for the next steps, Hubbard says it will cost thousands of dollars in repairs for the building. But he says everyone in the building is determined to pick up the pieces as quickly and as efficiently as they can.\n\n“This is an old building, it’s a tough old lady but she needs upkeep and she needs to be taken care of,” said Hubbard. “And that’s what we’re going to do. We’re going to put her back in shape and we’re going to be the Hadi Shrine that our community loves.”\n\nHubbard says the city is aware of the building’s flooding issues and that they have been in constant communication as repairs continue.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to Eyewitness News (WEHT\/WTVW).",
    "Atomic_Facts":"[\"Hadi Shrine Temple and Robert’s By The River in Evansville, Indiana, temporarily closed due to flash flooding that caused 3-4 inches of water damage, with significant repairs needed including drywall removal and kitchen cleaning.\", \"Rick Hubbard, Past Potentate of Hadi Shrine, stated that the flooding will severely impact Robert’s By The River, a startup restaurant, which has already been struggling due to nearby construction and a previous sinkhole closure.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/crews-replace-storm-sewer-pipe-162922109.html",
    "Date":"2025-07-23 19:15:00",
    "News_title":"Crews work to replace storm sewer pipe in Webberville",
    "News_text":"LANSING, Mich. (WLNS)– Construction crews in Webberville are working to replace deteriorating storm sewer pipes, which caused a sinkhole.\n\nThe sewer pipe is located along the north side of W. Grand River Road, just west of Elm Road to Summit Street.\n\nThe Ingham County Drain Commissioner reports the work is anticipated to be completed on August 22, 2025.\n\nCrews say during construction, W. Grand River Road will be open to traffic in both directions; however, the speed limit will be reduced to 25 mph in the work zone.\n\nThe Ingham County Drain Commissioner says there will be no left turns allowed either onto or from W. Grand River Road.\n\nThis will affect the turns onto and from Elm Street, S. Howard Street and Summit Street. Main Street will remain open for both left and right turns onto and from W. Grand River Road.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WLNS 6 News.",
    "Atomic_Facts":"[\"Construction crews in Webberville, Michigan, are replacing deteriorating storm sewer pipes along the north side of W. Grand River Road, with work expected to be completed by August 22, 2025.\", \"During the construction, the speed limit on W. Grand River Road will be reduced to 25 mph, and left turns onto or from W. Grand River Road will be prohibited.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/los-ranchos-residents-cleaning-wednesday-003106208.html",
    "Date":"2025-07-25 02:45:00",
    "News_title":"Los Ranchos residents cleaning up after Wednesday flooding",
    "News_text":"ALBUQUERQUE, N.M.(KRQE) – A quick rainstorm in the North Valley on Wednesday afternoon packed a big punch, leaving some residents scrambling to keep water from coming into their homes. Cell phone video sent to KRQE News 13 from Orlando Marquez showed his family quickly pushing water out of their Los Ranchos home on Wednesday afternoon. In less than 30 minutes, over an inch of rain fell.\n\nStory continues below\n\nNews:UNM issues shelter in place as shooting leaves 1 dead, 1 injured on Albuquerque campus\n\nTrending:VIDEO: Albuquerque bus driver stabs passenger after fight on the bus\n\nCommunity:What’s happening in New Mexico July 25-31? Lavender in the Village Festival and more\n\nOn Thursday, Marquez’s property was covered in mud as the family worked to clean up and dry out their home with fans.\n\n“There wasn’t too much damage. We were able to mitigate the amount of damage, thank goodness. Even though water got into the house, it’s just clean up, trying to make sure everything is aired out,” said Marquez.\n\nThe storm even caused a sinkhole. Bernalillo County said Wayne Rd. at Second St. near Paseo is closed because the heavy rainfall compromised the underlying drainpipe. Meanwhile, another Los Ranchos resident said a construction crew on Wednesday had just poured concrete on his property. “The winds were crazy, and the construction dudes were covering it over with a tarp, doing their best. They’re hiding underneath the tarp, and I was just like, ‘Come on. Get under the porch,’” said Los Ranchos resident John Sandlin.\n\nSandlin said the street was flooded all the way up to his driveway. He said the concrete is okay, but he saw damage inside his home.\n\nNearby areas on Thursday were wet and muddy. Los Ranchos officials said the northern part of the village saw the most impact due to the downpour, but they said there were no emergency calls about flooding on Wednesday. Now, as the ground is drying out, neighbors are thankful things weren’t worse. “It wasn’t anything worse like what we’ve seen in other places. We are grateful for that,” said Marquez.\n\nBernalillo County said they are working to bring a contractor to repair the sinkhole. No word on when it could be fixed.\n\nThe Village of Los Ranchos said future road projects include drainage improvements in the area.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos.",
    "Atomic_Facts":"[\"A rainstorm in Los Ranchos, New Mexico on July 25, 2025, resulted in over an inch of rain falling in less than 30 minutes, causing flooding in several homes and a sinkhole on Wayne Rd. at Second St. near Paseo.\", \"Bernalillo County officials announced they are working to bring a contractor to repair the sinkhole caused by the heavy rainfall, although no timeline for the repairs has been provided.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-repair-affect-salem-parkway-232100008.html",
    "Date":"2025-07-26 00:15:00",
    "News_title":"Sinkhole repair will affect Salem Parkway traffic",
    "News_text":"Work to repair a sinkhole along the side of Salem Parkway in Kernersville will require closing part of the southbound lanes on Monday, the N.C. Department of Transportation said.\n\nDrivers should expect delays Monday traveling on U.S. 421 South near Exit 228 (Linville Road), where crews with the N.C. Department of Transportation will repair a sinkhole forming on the shoulder.\n\nCrews will close the right lane for southbound traffic while the repairs are made. The work is scheduled to begin at 9 a.m. and last until the evening.\n\nDrivers should be alert traveling through this area.",
    "Atomic_Facts":"[\"The N.C. Department of Transportation announced that repair work on a sinkhole along Salem Parkway in Kernersville will close the right lane of southbound U.S. 421 South near Exit 228 (Linville Road) starting at 9 a.m. on July 26, 2025, with expected delays throughout the day.\", \"The sinkhole repair work on Salem Parkway is scheduled to be completed by the evening of July 26, 2025, according to the N.C. Department of Transportation.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/5-florida-lakes-most-snake-191001752.html",
    "Date":"2025-07-28 20:15:00",
    "News_title":"5 Florida lakes are most ‘snake-infested’ in the state, 2 are in Palm Beach County",
    "News_text":"Reptiles and Florida might as well be synonymous, especially when it comes to ourslithering neighbors.\n\nAccording tothe WorldAtlas, Florida has 46 native species of snakes, as well asfour invasive species— and don't forget the six categories of venomous snakes in the state.\n\n\"The state of Florida is a hotbed for snake activity. Lush ecosystems spread across a mix of tropical and subtropical climates are tailor-made for these cold-blooded slitherers,\" thegeography website states, adding that snakes are a vital part of our ecosystem.\n\nWe have more in common with these scaly serpents than we realize. Snakes and humans both love to seek out bodies of water to cool down in the sweltering summers. However, before you go swimming in your local lake, which is already questionable due to ourmassive alligator population, make sure it isn't also known for its large number of snakes.\n\nIt wouldn't be a list of the most \"snake-infested\" lakes without the Everglades popping up.\n\nWorldAtlas highlighted the lakes of South Florida's national park mainly for their large, unwelcome inhabitant — the Burmese python. These invasive species have dominated the waters within the Everglades for decades.\n\n\"Because of a combination of intentional releases by dissatisfied pet owners (pythons are popular exotic pets in this region) and 1992's Hurricane Andrew destroying a breeding facility (which released untold specimens into nearby swamps), the population of these snakes has grown at unmanageable rates,\" the report shares. \"Given their overwhelming reproductive habits and the fact that they can grow to over 15 feet in length and weigh over 200 pounds, these stealthy constrictors constitute one of the worst-case examples of invasive species on the planet.\"\n\nBesides the Burmese python, here are some other species you'll find in the Everglades, with those highlighted being venomous:\n\nCoral Snake\n\nEastern Diamondback Rattlesnake\n\nEastern Garter Snake\n\nEastern Indigo Snake\n\nFlorida Brown Snake\n\nFlorida Cottonmouth\n\nPygmy Rattlesnake\n\nRat Snake\n\nMoving a smidge north, we're highlighting the largest lake in the state, Lake Okeechobee. It is the tenth-largest freshwater lake in the country. When compared to freshwater lakes contained entirely within the U.S. boundary, it becomes the second-largest lake, surpassed only by Lake Michigan.\n\nThis 730-square-mile, shallow body of water, situated in the South-Central part of the state, is famous for its largemouth bass and speckled perch, as well as bluegills, Okeechobee catfish, and black crappies.\n\nHowever, other less-popular creatures also lurk nearby.\n\nCentral and Southern Florida have roughly 34 native species (four of which are venomous) and three invasive species of snakes. With that said, WorldAtlas says the most commonly sighted snakes are Florida green watersnakes, brown watersnakes, the Eastern kingsnake, Brahminy blind snakes, and the Florida king snake.\n\nNorthwest of state capital Tallahassee is Florida's Lake Seminole (not to be confused with Lake Seminole on the West coast of Central Florida) is a long and narrow reservoir.\n\nForty-five out of the state's 46 known native species and all six of the venomous varieties are found in the region. WorldAtlas says three different rattlesnakes are reported around Lake Seminole: timber, diamondback, and pygmy.\n\nCottonmouths (also known as the water moccasin) are also found around the lake, sometimes confused with non-venomous watersnakes.\n\nLeon County's Lake Iamonia is a seven-mile-long prairie lake that drains through a natural sinkhole during dry seasons and reforms when the rains return (despite an unsuccessful attempt at damming and regulating the levels between 1939 and 1980).\n\nWorldAtlas states that the lake is popular among photographers, paddlers, and nature lovers. Identified species include banded watersnakes, Florida green watersnakes, cottonmouths, Eastern kingsnakes, corn snakes, red-bellied snakes, Southern ribbon snakes, ringneck snakes, and scarlet snakes.\n\nNorth Florida's Lake Talquin is our final stop. This former floodplain-turned-manmade reservoir west of Tallahassee is well-stocked with fish and birds, along with their slithering companions.\n\nCottonmouths, red-bellied watersnakes, and brown watersnakes are the big three commonly found in this 15-square-mile lake and around its 40 miles of shoreline, according to WorldAtlas.\n\nThis article originally appeared on Palm Beach Post:Florida snake population highest in these 5 lakes, WorldAtlas reports",
    "Atomic_Facts":"[\"WorldAtlas reported on July 28, 2025, that Lake Okeechobee is the largest lake in Florida and the tenth-largest freshwater lake in the United States, covering an area of 730 square miles.\", \"WorldAtlas highlighted that Lake Seminole, located northwest of Tallahassee, is home to all six venomous snake species found in Florida, including timber, diamondback, and pygmy rattlesnakes.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/frustrated-horton-street-residents-meet-030544614.html",
    "Date":"2025-07-29 05:45:00",
    "News_title":"Frustrated Horton Street residents meet with Wilkes-Barre mayor",
    "News_text":"WILKES-BARRE, LUZERNE COUNTY (WBRE\/WYOU) —It’s been a month since one of two giant sinkholesopened up on the same street in Wilkes-Barre. People who live there are frustrated by the inconvenience it’s caused.\n\nOn Monday, they got some clarity on when their lives may return to normal.\n\nThe idea was to gather everyone involved in fixing the sinkhole, gas and water companies, the city’s engineer, and the mayor, and answer questions from neighbors about their disruptive road closure.\n\nBut those residents found out on Monday the Horton Street hole won’t be fixed anytime soon.\n\nPeople living on Horton Street are still being affected by the sinkhole that opened up in front of their homes in June.\n\nMayor George Brown invited the residents to a nearby restaurant to give them updates on the reconstruction process.\n\n“They’ve been really going under some tough times since June 25, when we had the sinkhole crash, so, the idea was to bring our team together, get as many people here as we can, so that they know what’s going on and what the future’s going to look like for them,” Mayor Brown explained.\n\nMonroe County announces property reassessment project\n\nThose in attendance were able to ask questions to the crews directly working on the projects.\n\nSome people also expressed the ways their everyday lives are affected by this disruption.\n\n“Parking, having direct access to my driveway to the house, we have to park around the neighborhood. It’s gotten to the point now where if you get home after a certain time, you have to go around a few times,” Wilkes-Barre resident Eileen Venero told 28\/22 News.\n\nMayor Brown tells 28\/22 News it could be three to four weeks to finish cleaning out the sewer line and another week to install an interior line.\n\n“I’ve been the mayor six years, this is the worst I’ve seen it,” Mayor Brown added.\n\nNeighbors say it’s a good start, but there needs to be a long-term solution, including less truck traffic on Horton Street.\n\n“I’m just hoping they do fix it, and fix it properly. Maybe get rid of the trucks, reroute them, pave the street over. Come check out our houses and see if we need anything because of what’s going on. Nobody’s asked that. You take these things with a grain of salt, I’m sorry to say that, but it’s true. I’ve been through, not this, but other things, and usually what they say is not always what they do, unfortunately. I’m hoping, I have hope,” Venero continued.\n\nThe estimated timeline for the construction on Horton Street is about five to six weeks until residents can return to normalcy.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to 28\/22 News.",
    "Atomic_Facts":"[\"Mayor George Brown announced on July 29, 2025, that the reconstruction process for the sinkhole on Horton Street in Wilkes-Barre will take approximately five to six weeks to complete, with an estimated three to four weeks needed to clean out the sewer line and an additional week for installing an interior line.\", \"Residents of Horton Street have been affected by a sinkhole that opened on June 25, 2025, causing significant disruptions, including difficulties with parking and access to their homes.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-swallows-car-stopped-traffic-124335264.html",
    "Date":"2025-07-29 15:00:00",
    "News_title":"Sinkhole swallows car stopped at traffic light near Coastal Grand Mall in Myrtle Beach",
    "News_text":"EDITOR’S NOTE: This story has been updated to correct the location of the incident and remove a video that contained the incorrect information. We apologize for the error.\n\nMYRTLE BEACH, S.C. (WBTW) — A Myrtle Beach driver walked away unhurt Tuesday morning after the roadway gave out beneath his car while he was stopped at a traffic light near the Coastal Grand Mall.\n\nMyrtle Beach city officialssaid the sinkhole was caused by a broken six-inch water main, but an official with the Public Works Department told News13 later that it was caused by a broken 12-inch water main. The area where the sinkhole formed is near the Horry County Ride III construction site.\n\nMyrtle Beach police responded at about 4:30 a.m. to the intersection of Mall Drive and Harrelson Boulevard and found the front end of the car submerged in a large sinkhole. A Myrtle Beach Public Works employee told News13 that officials received a call between 4 a.m. and 5 a.m. about low water pressure in the area.\n\nThe water in the area was shut off, and the car was removed from the hole Tuesday morning, officials said. The driver’s father told News13 his son was stopped at the light when the car started to sink. Police said the driver walked away and was not hurt.\n\nWhile officials say it was nothing more than a mechanical issue, Myrtle Beach drivers Xavier Horne and Charleston Porter hope they aren’t the next driver caught in a freak accident.\n\n“That’s shocking. That’s scary, too,” Horne said.\n\n“That is absolutely insane,” Porter said. “I hope that they are OK. That definitely needs to be fixed.”\n\nOfficials say they cut out and replaced the broken section of pipe where the water was turned back on around 1 p.m.\n\n“We have movement in our soil between the hot and cold. This really wasn’t heat-related,” Public Works employee Chris Miller said. “This was more of just a material failure. So it’s not unheard of that a fitting or a piece of pipe fails. It’s unusual that this is brand new and that it has failed. Again, I don’t want to say it was an act of God, but it was certainly out of the city of Myrtle Beach’s control.”\n\nThe South Carolina Department of Transportation said Tuesday afternoon that the entrance to Mall Drive was closed to allow crews to begin repairing the roadway. The work is expected to be completed on Wednesday.\n\n* * *\n\nDennis Bright is the Digital Executive Producer atNews13. He joined the team in May 2021. Dennis is a West Virginia native and a graduate of Marshall University in Huntington, West Virginia. Follow Dennis onFacebook,X, formerly Twitter, and read more of his workhere.\n\n* * *\n\nSkylar Musick is a multimedia journalist at News13. Skylar is originally from Long Island, New York. She joined the News13 team in June 2024 after graduating from Villanova University in May 2024. Follow Skylar onX, formerly Twitter,Facebook, orInstagram, and read more of her workhere.\n\n* * *\n\nGabby Jonas joined the News13 team as a multimedia journalist in April 2024. She is from Columbus, Ohio, and graduated from Kent State University in May 2023. Follow Gabby onX, formerly Twitter,FacebookorInstagram, and read more of her workhere.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WBTW.",
    "Atomic_Facts":"[\"A sinkhole formed at the intersection of Mall Drive and Harrelson Boulevard in Myrtle Beach, South Carolina, on July 29, 2025, after a broken 12-inch water main caused the roadway to collapse while a driver was stopped at a traffic light.\", \"Myrtle Beach Public Works employees replaced the broken section of the water main and restored water service by 1 p.m. on July 29, 2025, following the incident that occurred around 4:30 a.m.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/homeowner-outraged-hoa-creates-dangerous-104550629.html",
    "Date":"2025-07-30 12:30:00",
    "News_title":"Homeowner outraged after HOA creates dangerous situation in neighborhood street: 'A death trap'",
    "News_text":"One Redditor put their homeowners association on blast for creating dangerous conditions for residents and taking their money in the process.\n\nThe saga was rehashed in ther\/f***HOAsubreddit. According to the Redditor, the HOA hired workers to repair water leaks that had been occurring for months. However, the repair caused significant damage to the road, which the OP had called \"a death trap.\"\n\n\"To add insult to injury, they hired a cheap dude in a van who showed up with a few bags of asphalt, covered the visible holes, didn't address the actual sinkhole, and dipped as fast as he pulled in,\" the OPwrote.\n\nThe OP stated that the initial repair caused even more leaks, prompting the HOA to shut off the water for extended periods. To resolve the issues, the HOA presented two options for neighbors to vote on at the end of the year. They can either double their monthly rates or pay a special assessment.\n\nRoughly74 million peoplein the United States live in HOA communities. HOA restrictions can prevent homeowners from saving money and making eco-friendly updates to their homes, like adding rooftopsolar panelsor installingnative plant lawns. Delaying the progress can have negative impacts on homeowners and the environment.\n\nFor instance, installingsolar panelscan significantly reduce the cost of energy.EnergySageoffers a free service that enables homeowners to compare quotes from local installers and potentially save up to $10,000 on solar installations. Plus, there's the added benefit of reducing heat-trapping pollution and water consumption by switching to solar.\n\nHomeowners looking to make eco-friendly upgrades to their homes can potentially work with their HOA to change the established rules.\n\nAs for theReddit post, commenters were appalled but not surprised by the actions taken by the HOA.\n\n\"They went for cheap, when you do that you get cheap,\" one commentersaid.\n\n\"Lol the one time an HOA is actually potentially useful, they **** it up by going cheap,\" another commenterwrote.\n\nShould the government continue to give tax incentives for energy-efficient home upgrades?\n\nAbsolutely\n\nNo\n\nDepends on the upgrade\n\nI don't know\n\nClick your choice to see results and speak your mind.\n\nJoin ourfree newsletterfor easy tips tosave moreandwaste less, and don't missthis cool listof easy ways to help yourself while helping the planet.",
    "Atomic_Facts":"[\"The homeowners association (HOA) in a neighborhood hired a contractor who inadequately repaired water leaks, resulting in further damage to the road and prompting the HOA to shut off water for extended periods.\", \"The HOA presented two options for residents to vote on at the end of the year: either double their monthly rates or pay a special assessment to address ongoing issues.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/one-world-most-isolated-countries-091458095.html",
    "Date":"2025-07-31 10:30:00",
    "News_title":"One of the world’s most isolated countries, this former Soviet state is showing signs it’s ready for more tourists",
    "News_text":"When the Turkmenistan government announced newstreamlined visa regulationsin April, people familiar with traveling to the Central Asian nation were unsure what to make of it.\n\nNot that there are many such experts — along with North Korea and Eritrea, Turkmenistan has long been considered one of the globe’s most isolated countries, a legacy that dates to the 1990s when the nation broke away from the disintegrating Soviet Union and turned inward, settling into a sealed-off, independent authoritarianism.\n\nFor certain travelers, though, especially those who gravitate toward conflict zones and geopolitical oddities, Turkmenistan’s impenetrability has given it an alluring mystique. There’s just one problem: getting in.\n\nScoring a tourist visa is a long and involved process that requires obtaining a Letter of Introduction (LOI) from the Ministry of Foreign Affairs after booking your visit with a government-approved tour operator. The vetting — the government decides if you should be allowed to enter — can sometimes take months.\n\nWord that the regime intended to make things more user-friendly for travelers, then, was startling, says Dylan Lupine, whose UK-basedLupine Traveloffers small-group Turkmenistan tours.\n\n“We are still in the dark about it, as are our local partners in Turkmenistan, as there have been no updates since,” Lupine says. “The new visa regulations haven’t yet come into place and there’s no news of when this will be happening.”\n\nIf and when the new process kicks off, visitors would be able to apply online, with officials pledging that it will be much faster and result in fewer rejections. The LOI requirement willreportedly vanish, but visitors will still need a “sponsor” in Turkmenistan, which in most cases means signing up for a guided tour.\n\n“Once it does come into place, I do think it will strongly boost visitor numbers,” Lupine adds.\n\nCNN has reached out to Turkmenistan’s Ministry of Foreign Affairs for comment.\n\nFor decades — even before independence from the USSR — Turkmenistan’s main attraction has been theDarvaza Gas Crater. Located in the Karakum Desert about a four-hour drive from capital city Ashgabat, the huge fiery pit is a manmade phenomenon, created during the Soviet era when a natural gas exploration rig collapsed into a sinkhole.\n\nAfter traveling across the desert in 4x4 caravans, visitors check into yurt camps and make their way to the edge of the rim around the “Gates of Hell” after dark to feel the heat and listen to the sizzle of the flames licking up from the bottom.\n\nHowever, Darvaza is literally running out of gas. In recent years, the flames have noticeably receded, and there are predictions the crater may flame out completely in coming years.\n\nBut that doesn’t mean there aren’t other reasons to visit. Ancient Silk Road cities with their historic mosques and minarets offer dramatic contrast to Ashgabat with its over-the-top modern architecture and grandiose monuments featuring everything from post-communist leaders and medieval poets to golden horses, the national dog, and a gigantic bull balancing the world on its head.\n\nGiven the fact they encounter very few foreign visitors, the Turkmen people are warm and welcoming. If arid landscapes are your thing, around 80% of Turkmenistan is desert. And there’s the novelty of exploring a place that few others have visited in modern times.\n\n“Turkmenistan is unlike any country I have visited,” says the Norwegian writer and anthropologist Erika Fatland, author of “Sovietistan” and other books about Central Asia and the former Soviet Union.\n\n“The shining white marble capital of Ashgabat, with its empty lanes, is one of the weirdest capitals I have ever visited.”\n\nSpangled with golden statues and white marble, Ashgabat is bothan architectural wonderand Instagram icon. Many of the structures are shaped like their government functions — like a Ministry of Oil & Gas building that resembles a giant lighter. Others were created to capture Guinness World Records — including theworld’s largest indoor Ferris wheeland acolossal horse headthat hovers above the national stadium.\n\nAt the city’s indoor Russian Bazaar, vendors offer samples of caviar harvested from Turkmenistan’s slice of the Caspian Sea, as this writer discovered during a recent visit. A blend of Persian and Central Asian influences, the culinary scene is surprisingly good. Nightlife is rather limited, but you can grab a cold beer at Clever’s Irish Pub or the Florida British Pub.\n\nOnce in a strategic position along the Silk Road trading route between Asia and Europe, the country has multipleUNESCO World Heritage Sitesincluding the Parthian Fortresses of Nisa near Ashgabat and the sprawling ruins of Merv in eastern Turkmenistan. Even more impressive are the richly decorated grand mosque, tombs and towering minaret at Kunya-Urgench in the far north.\n\n“My most beautiful experiences in Turkmenistan were in the countryside, in the desert, where I encountered the friendliest, most hospitable people I have ever met,” says Fatland. “The only drawback was the fermented camel milk,chal, the de facto national drink, that they kept serving me in generous quantities. Let’s just say that it’s an acquired taste.”\n\nIronically, Turkmenistan was easier to visit during the Soviet days, when Intourist expedited travel in the USSR. Created in 1929 by autocratic leader Joseph Stalin, the state travel agency was tasked with earning foreign exchange via tourism and making sure visitors (nearly all of them on closely supervised guided tours) only saw the best side of the Soviet Union.\n\nWith offices in London, New York and other foreign cities, Intourist lured travelers with striking posters and newspaper ads. Among the tours they offered in the 1930s was a 16-day Immemorial Cities of Turkestan journey that included a stop in “flourishing Ashkhabad.”\n\nTourism grew slowly at first. But with the Cold War thawing in the 1980s, the USSR was attracting around four million tourists per year. The unraveling of the Soviet Union after the fall of the Berlin Wall offered a chance to increase visitation even more. Yet Turkmenistan didn’t leap on the bandwagon.\n\nWhen Moscow offered its 14 socialist republics independence in 1991, Turkmen leader Saparmurat Niyazov initially balked at the notion.\n\n“It’s really all down to Niyazov,” says Lupine. “Prior to the breakup of the Soviet Union, his actions demonstrated negativity against perestroika and glasnost. He brought in his own methods after independence, but they were strongly influenced by the Soviet model.”\n\nOr rather theoldSoviet model that limited overall tourist numbers and kept them on a tight leash, on guided tours that included only the aspects of Turkmenistan that Niyazov wanted to show the outside world.\n\nMeanwhile, the country’s huge gas reserves meant Turkmenistan was able to remain self-reliant and neutral in the post-Soviet era, eliminating the need for any outside international influence. Even after Niyazov’s death in 2006, the new leadership continued to keep a tight rein on foreign visitation.\n\nBut there are hints that change might be just around the corner.\n\nAccording to the most recent Bertelsmann Transformation Index (BTI) report on Turkmenistan, the country has been plagued by economic woes for nearly a decade. Hoping to attract more foreign investment and increase employment, the government has been seeking economic cooperation with other nations, like the natural gassharing arrangementit recently forged with Turkey and Iran.\n\nSome observers think the move to simplify its visa approvals process and increase tourism is part of this overall strategy, another way to boost its foreign exchange reserves. Tourism is booming in Uzbekistan and Kazakhstan, two of its Central Asian neighbors.\n\n“When Uzbekistan simplified their visa procedures after (President Islam) Karimov’s death, tourism increased manifold, and maybe they are hoping for similar effects in Turkmenistan,” says Fatland.\n\n“The other ‘Stans’ have all opened for visa-free entry for many nationalities, so maybe the Turkmen felt the need to loosen up a bit.”\n\nFor more CNN news and newsletters create an account atCNN.com",
    "Atomic_Facts":"[\"The Turkmenistan government announced in April 2025 that it will implement new streamlined visa regulations, allowing visitors to apply online and eliminating the Letter of Introduction requirement, although a local sponsor will still be necessary.\", \"The Bertelsmann Transformation Index report indicates that Turkmenistan has faced economic challenges for nearly a decade, prompting the government to seek increased foreign investment and tourism as part of its strategy to boost foreign exchange reserves.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/significant-sinkhole-closes-york-county-154238651.html",
    "Date":"2025-08-01 17:45:00",
    "News_title":"“Significant sinkhole” closes York County street",
    "News_text":"WEST YORK, Pa. (WHTM) – A “significant sinkhole” has closed a portion of West Philadelphia Street in West York Borough.\n\nAccording to the borough, West Philadelphia Street is closed between N. Diamond Street and N. Clinton Street due to the sinkhole. The borough says the sinkhole is located outside 1811 and 1809 West Philadelphia Street.\n\nTemporary safety measures have been implemented until a permanent solution is complete.\n\nThis is a developing story. Stay with abc27 News as more information becomes available\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to ABC27.",
    "Atomic_Facts":"[\"A significant sinkhole has closed West Philadelphia Street in West York Borough, Pennsylvania, between N. Diamond Street and N. Clinton Street, as of August 1, 2025.\", \"The sinkhole is located outside the addresses 1811 and 1809 West Philadelphia Street, prompting the borough to implement temporary safety measures until a permanent solution is completed.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/water-main-break-leads-massive-225751249.html",
    "Date":"2025-08-05 23:45:00",
    "News_title":"Water main break leads to massive sinkhole in the middle of a Pittsburgh street",
    "News_text":"A massive sinkhole in Pittsburgh’s Regent Square area has left residents concerned and without water as crews work to repair the damage. The hole, large enough to swallow a car, appeared on Peebles Street earlier this week with little warning.\n\nKate Schaich, who lives nearby, described noticing the first signs of trouble.\n\n“The water pressure was fine, there was no discoloration, but you could hear the sewer water rushing, which is not something you would normally hear,” she said.\n\nSchaich and a neighbor noticed a small dip in the road and alerted the Wilkinsburg-Penn Joint Water Authority.\n\nConcerned for her neighbors’ cars parked nearby, she added, “I thought, whew, if that gets any bigger.”\n\nBy Monday afternoon, the road had completely caved in. Crews determined that the water and sewer lines in the area, which are more than 100 years old, needed repairs. According to the Water Authority, aging infrastructure makes these types of issues more common in the neighborhood.\n\nWorkers are replacing a section of the water line and repairing the sewage line, but the repairs mean some residents will be without water for several hours. Schaich says the outage is frustrating but hopes the fix will last.\n\n“I hope it’s permanent, but we have so many issues with the pipes around here. Last year and two years ago, they were digging up all the water lines,” she said.\n\nThe water authority has not given an exact timeline for restoring service, but crews believe service will be restored by Tuesday night.\n\nDownload theFREE WPXI News appfor breaking news alerts.\n\nFollow Channel 11 News onFacebookandTwitter. |Watch WPXI NOW",
    "Atomic_Facts":"[\"A massive sinkhole appeared on Peebles Street in Pittsburgh’s Regent Square area earlier this week, large enough to swallow a car, leading to concerns among residents and a water outage as crews work on repairs.\", \"The Wilkinsburg-Penn Joint Water Authority reported that the water and sewer lines in the area, which are over 100 years old, require repairs, and service is expected to be restored by Tuesday night, August 6, 2025.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/riverside-drive-sinkhole-project-clear-224351492.html",
    "Date":"2025-08-06 01:30:00",
    "News_title":"Riverside Drive sinkhole project to clear major obstacle",
    "News_text":"HENDERSON, Ky (WEHT) – The sinkhole project on Riverside Drive in Evansville is set to clear a major obstacle.\n\nThe Evansville Water and Sewer Utility states the sewer replacement will begin to install sheet piling around the project footprint.\n\nOfficials state the work is scheduled to take about two to three weeks to complete.\n\nOfficials state crews are using a vibration hammer to drive 90 pairs of sheet piling, 50 feet long each, about 46 feet into the ground. This will allow a safe area for crews to dig down to the collapsed brick sewer and begin repairs.\n\nThis comes after a sinkhole formed in March and grew into a large sewer rehab project in April. Following weeks of rain, the sinkhole turned into a full sewer replacement project.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to Eyewitness News (WEHT\/WTVW).",
    "Atomic_Facts":"[\"The Evansville Water and Sewer Utility announced on August 6, 2025, that the sewer replacement project on Riverside Drive in Evansville will begin using a vibration hammer to drive 90 pairs of 50-foot-long sheet pilings 46 feet into the ground.\", \"The sewer replacement project on Riverside Drive is expected to take two to three weeks to complete, following the formation of a sinkhole in March 2025 that escalated into a full sewer replacement project in April 2025.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-drains-benton-park-lake-033126241.html",
    "Date":"2025-08-07 05:45:00",
    "News_title":"Sinkhole drains Benton Park Lake, leaving fish stranded",
    "News_text":"ST. LOUIS – The fish are gone, and a sinkhole is being blamed for the empty Benton Park Lake. Where did the water go, and the fish that swam in it? The City of St. Louis and the Missouri Department of Conservation are working together to sort it all out.\n\n“Benton Park Lake, unfortunately, has an issue with a cave nearby, which is a sinkhole that is drawing water out of the lake,” Dan Zarlenga, Missouri Department of Conservation, said. “It’s hard to keep water in the lake. As long as this issue happens, it’s hard to keep water in the lake and fish in the water, because the fish need the water.”\n\nZarlenga says the conservation department issued a fish salvage order.\n\n“Which means, we’re basically suspending all fishing regulations on that particular lake in order to get the fish removed before the water was completely drained,” he said.\n\nRunner brutally injured in dog attack at Forest Park\n\nSt. Louis and the Missouri Department of Conservation work together on the city’s urban lakes, stocking them with channel catfish, hybrid sunfish, and trout.\n\nWhile you need a fishing license to fish at the lakes, rules on the number of fish and ways you could catch them were suspended for Benton Park Lake. Meaning, a lot of fish wound up on dinner plates.\n\nIt’s unclear how long the lake will be drained and when the fish will return to this lake.\n\n“There’s a lot of caves in St. Louis and Missouri,” Zarlenga said. “So, it’s a unique topography that we have in this state that provides us with some great resources. But occasionally, that can also provide us with some sinkholes as well.”\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to FOX 2.",
    "Atomic_Facts":"[\"The City of St. Louis and the Missouri Department of Conservation issued a fish salvage order for Benton Park Lake on August 7, 2025, suspending all fishing regulations to remove fish before the lake was completely drained due to a sinkhole.\", \"Dan Zarlenga from the Missouri Department of Conservation stated that the sinkhole near Benton Park Lake is causing significant water loss, making it difficult to maintain fish populations in the lake.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/large-sinkhole-opens-outside-cogans-151800224.html",
    "Date":"2025-08-07 17:30:00",
    "News_title":"Large sinkhole opens up outside Cogans Pizza in Ghent",
    "News_text":"NORFOLK — A sinkhole several feet wide formed just a few feet from the front entrance to Cogans Pizza in Ghent over the past few days.\n\nThe sinkhole, at the intersection of Colonial Avenue and Washington Park, was surrounded by traffic barrels and caution tape Thursday morning.\n\nNorfolk spokesperson Kelly Straub said the sinkhole was caused by a stormwater pipe and Norfolk Public Works crews were working to repair it.\n\nHolly Pim, general manager of Cogans, said city workers had actually opened up the hole some in an attempt to repair it, and she had seen crews there several times.\n\n“It’s just kind of part of our old, old city charm,” Pim said.\n\nJust like many parts of the city, Pim said that area of Colonial Avenue also experiences issues with flooding after heavy rain.\n\nNorfolk resident Tom McAnulty said in an email he was a frequent customer at nearby coffee shop, Cafe Stella, and had noticed the city attempting to repair the sinkhole several times over the past few years.\n\nSinkholes have formed in Norfolk before: a12-foot-deep hole formed on East Princess Anne Roadwhen a water main broke in late 2017. Hampton Roads Bridge-Tunnel constructioncaused another hole to formnear the Interstate 64 East on ramp at the 4th View Street exit in 2022.\n\nPim said the hole hadn’t affected visitors to Cogans or other businesses, but hoped it would be repaired quickly.\n\nTrevor Metcalfe, 757-222-5345,trevor.metcalfe@pilotonline.com",
    "Atomic_Facts":"[\"A sinkhole several feet wide opened up near the front entrance of Cogans Pizza in Ghent, Norfolk, at the intersection of Colonial Avenue and Washington Park, prompting repairs by Norfolk Public Works crews.\", \"Norfolk spokesperson Kelly Straub stated that the sinkhole was caused by a stormwater pipe issue, and city workers had previously attempted repairs on the hole several times over the past few years.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/large-sinkhole-forms-near-cogans-191105261.html",
    "Date":"2025-08-07 22:30:00",
    "News_title":"Large sinkhole forms near Cogans Pizza in Ghent",
    "News_text":"NORFOLK, Va. (WAVY) — A large sinkhole has formed several feet from the front entrance of Cogans Pizza in Ghent.\n\nThe sinkhole, located at the intersection of Colonial Avenue and Washington Park, was surrounded by caution tape and traffic drums on Thursday.\n\nNorfolk Public Works crews are working to repair the sinkhole, which was caused by a failed stormwater pipe, according to City of Norfolk spokesperson Kelly Straub.\n\nContinue to check WAVY.com for updates.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WAVY.com.",
    "Atomic_Facts":"[\"A large sinkhole formed on August 7, 2025, several feet from the front entrance of Cogans Pizza at the intersection of Colonial Avenue and Washington Park in Ghent, Norfolk, Virginia.\", \"Norfolk Public Works crews are currently working to repair the sinkhole, which was caused by a failed stormwater pipe, according to City of Norfolk spokesperson Kelly Straub.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-closes-part-midlothian-boulevard-201257226.html",
    "Date":"2025-08-07 23:00:00",
    "News_title":"Sinkhole closes part of Midlothian Boulevard",
    "News_text":"YOUNGSTOWN, Ohio(WKBN) – A portion of Midlothian Boulevard in Youngstown is closed due to a sinkhole.\n\nWork began today to repair a sinkhole on Midlothian Boulevard — that opened up yesterday — causing the eastbound lanes right around I-680 to be closed.   The hole was caused by the collapse of a sanitary sewer line.  It created a hole 11 feet deep.\n\nRead next: Local company looking to hire over 100 people\n\nAccording to the city’s Department of Public Works, the eastbound lanes are closed between Shirley Road and Lemoyne Drive — in front of Steel City Bar and Grill — due to the collapse of a 30-inch sanitary sewer and manhole.\n\nRepairs began Friday. A city official said that barring something unforeseen, the work should be done and the road reopened in a week or so.\n\nThe posted detour will be Interstate 680 South to U.S. Route 224 to I-680 North to Midlothian Boulevard.\n\nJon Rudder contributed to this report.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WKBN.com.",
    "Atomic_Facts":"[\"A sinkhole caused by the collapse of a 30-inch sanitary sewer line opened up on August 6, 2025, leading to the closure of the eastbound lanes of Midlothian Boulevard in Youngstown, Ohio, between Shirley Road and Lemoyne Drive.\", \"Repairs on the sinkhole began on August 7, 2025, and are expected to be completed within a week, according to the city’s Department of Public Works.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/village-merton-dnr-dam-not-214011265.html",
    "Date":"2025-08-13 22:30:00",
    "News_title":"Village of Merton, DNR say dam is not at risk, countering earlier post from Hartland",
    "News_text":"The Village of Merton president, along with Wisconsin Department of Natural Resources officials, stressed August 13 that a dam on Bark River is fine, and information causing alarm about its condition was confusing.\n\n\"It's in good working order,\" said Ron Reinowski.\n\nA day earlier, the Hartland Police Department said in aFacebook postthat an emergency action plan had been activated for the Merton Millpond Dam. The post said the dam had a \"high potential for failure.\" The post remained up Aug. 13.\n\nThe post said the Wisconsin Department of Natural Resources would be able to reinforce the dam, and residents and businesses along the river should be aware of the potential rise in water levels.\n\nFollowing news of the post, DNR officials said the department is a regulatory agency, and while it gives technical advice, it does not get involved in reinforcing a dam. The department is \"not going to be picking up shovels and bringing in dirt,\" Reinowski said, concurring.\n\nAs for the integrity of the dam, the DNR said it was not a concern, something echoed by the village president.\n\nNeither Village of Hartland nor Waukesha County Emergency Management officials returned several phone calls for comment.\n\nA sinkhole appeared to be forming near the dam, but it did not appear to create a risk. \"With the condition it's in right now, it would be wasting money trying to do anything down inside that hole to stabilize it,\" Reinowski said.\n\nFor now, the area is being fenced off.\n\nAccording to the National Inventory of Dams, the Merton dam was constructed in 1840 and was last inspected in 2021, when it was found to be in fair condition. It is owned by the Village of Merton.\n\nThis article originally appeared on Milwaukee Journal Sentinel:Village of Merton, DNR say dam is sound, countering Hartland post",
    "Atomic_Facts":"[\"On August 13, 2025, Village of Merton President Ron Reinowski stated that the Merton Millpond Dam on Bark River is in good working order, countering a Hartland Police Department post that claimed the dam had a \\\"high potential for failure.\\\"\", \"The Wisconsin Department of Natural Resources clarified on August 13, 2025, that it does not engage in reinforcing dams, despite earlier claims that it would reinforce the Merton Millpond Dam following concerns raised by the Hartland Police Department.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/alea-closes-portion-59-south-143815040.html",
    "Date":"2025-08-14 16:45:00",
    "News_title":"ALEA closes portion of I-59 South due to sinkhole development in DeKalb County",
    "News_text":"DEKALB COUNTY, Ala. (WHNT) — The Alabama Law Enforcement Agency (ALEA), has closed a portion of I-59 South in DeKalb County due to a development of a sinkhole on Thursday.\n\nDeKalb County Emergency Management Agency said that the closure is taking place at I-59 South at mile marker 205.\n\nALEA told News 19 that a construction project is underway and has caused a closure of the southbound lanes of I-59.\n\nAuthorities said that the closure will be in place for an undetermined amount of time.\n\nTraffic is being detoured from I-59 Southbound at Exit 205 to AL-68 to US-11.\n\nAccording to ALDOT, repairs should take 4-6 hours .\n\nThe Alabama Law Enforcement Agency will continue to monitor the situation and provide updates.\n\nStay connected with News 19 as we will continue to update the story as more information becomes available.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WHNT.com.",
    "Atomic_Facts":"[\"The Alabama Law Enforcement Agency (ALEA) closed a portion of I-59 South at mile marker 205 in DeKalb County on August 14, 2025, due to the development of a sinkhole.\", \"Repairs for the sinkhole on I-59 South are expected to take 4-6 hours, with traffic being detoured from I-59 Southbound at Exit 205 to AL-68 to US-11.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/austintown-infrastructure-largely-managed-heavy-221840840.html",
    "Date":"2025-08-15 00:30:00",
    "News_title":"Austintown infrastructure largely managed heavy rainfall",
    "News_text":"AUSTINTOWN, Ohio(WKBN) – In the morning afterWednesday’s heavy rainstorms, most of the water that flooded some local neighborhoods was already gone.\n\n“As far as we’re aware right now, we have no road closures,” said Austintown Township Administrator Mark D’Apolito.\n\nBut Wednesday evening was a different story altogether. Neighbors in the Boulder Creek development in Austintown sent WKBN 27 First News videos of water rushing between homes and down the street. Some kids even took to body surfing.\n\nOne homeowner sent a photo taken as the rains were starting, and another just ten minutes later. WKBN Storm Team 27 meteorologists say at that point the storm was dumping at a rate of nearly six inches an hour.\n\nTownship road crews were out Thursday morning, clearing away debris from storm drains. They also discovered a sinkhole that developed when the rainwater washed away the ground next to an existing storm line.\n\nAs neighbors cleaned up the mess, workers checked on a retention pond nearby where the water level rose several feet, but largely did its job.\n\n“They all functioned. We’re not aware of anything washing out. We’re not aware of any large-scale flooding,” D’Apolito said.\n\nD’Apolito showed a map detailing the township’s 120 miles of storm sewer lines. He says the system is engineered to handle average rainfall, adding that Wednesday’s 2-to-3 inches surpassed that.\n\nHomes in low-lying areas, or without separate storm and sanitary lines, had some of the worst problems. D’Apolito said those issues homeowners may need to address on their own.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WKBN.com.",
    "Atomic_Facts":"[\"Austintown Township Administrator Mark D’Apolito reported that on August 14, 2025, heavy rainstorms caused flooding in the Boulder Creek development, with rainfall rates reaching nearly six inches per hour.\", \"Township road crews discovered a sinkhole on August 15, 2025, while clearing debris from storm drains after the rainstorm, indicating significant erosion around an existing storm line.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/iraq-starts-excavation-suspected-islamic-202153754.html",
    "Date":"2025-08-17 21:30:00",
    "News_title":"Iraq starts excavation of suspected ISIS mass grave",
    "News_text":"Iraqiofficials have begun the excavation of what is believed to be a mass grave left behind byISISduring its rampage across the country a decade ago.\n\nLocal authorities are working with the judiciary, forensic investigations,Iraq's Martyrs' Foundation, and the directorate of mass graves to carry out the excavation of the site of a sinkhole in al-Khafsa, south of the northern city of Mosul, the state-run Iraqi News Agency reported Sunday.\n\nAhmad Qusay al-Asady, head of the Martyrs Foundation's mass graves excavation department, told The Associated Press that his team began work at Khasfa on Aug. 9 at the request of Nineveh province's Gov. Abdulqadir al-Dakhil.\n\nThe operation is initially limited to gathering visible human remains and surface evidence while preparing for a full exhumation that officials say will require international support.\n\nAfter an initial 15 days of work, the foundation's Mosul teams will build a database and start collecting DNA samples from families of suspected victims.\n\nAl-Asady explained that laboratory processing and a DNA database must come first to ensure proper identification. Full exhumations can only proceed once specialized assistance is secured to navigate the site's hazards, including sulfur water and unexploded ordnance.\n\nKhasfa is \"a very complicated site,\" he said.\n\nBased on unverified accounts from witnesses and families and other unofficial testimonies, authorities estimate that thousands of bodies could be buried there, he said.\n\nScores of mass gravescontaining thousands of bodies of people believed to have been killed by ISIShave been found in Iraqand Syria.\n\nSome of the mass graves found in Iraq over the past two decades are believed to date back to the early 1990s, during Saddam Hussein's regime. Other mass graves includebodies of women and children.\n\nAt its peak, ISIS ruled an area half the size of the United Kingdom in Iraq and Syria and was notorious for its brutality. It beheaded civilians and enslaved and raped thousands of women from the Yazidi community, one of Iraq's oldest religious minorities. The extremist group has boasted of massacring Shiites and other opponents, often releasing gruesome videos and pictures of the killings.\n\nThe group was defeated in Iraq in July 2017, when Iraqi forces captured the northern city of Mosul. Three months later, it suffered a major blow when Kurdish forces captured the Syrian northern city of Raqqa, which was the group's de facto capital. The war against ISIS officially ended in March 2019, when U.S.-backed and Kurdish-led fighters of the Syrian Democratic Forces captured theeastern Syrian town of Baghouz, which was the last sliver of land the extremists controlled.\n\nRabah Nouri Attiyah, a lawyer who has worked on more than 70 cases of missing people in Nineveh, told the AP that information he obtained from the foundation and different Iraqi courts during his investigations points to Khasfa as \"the largest mass grave in modern Iraqi history.\"\n\nAl-Asady, however, said investigators \"cannot confirm yet if it is the largest mass grave\" to be found in Iraq, \"but according to the size of the space, we estimate it to be one of the largest.\"\n\nAttiyah said roughly 70% of the human remains at Khasfa are believed to belong to Iraqi army and police personnel, with other victims including Yazidis.\n\nHe said he has interviewed numerous eyewitnesses from the area who saw IS fighters bring people there by bus and kill them. \"Many of them were decapitated,\" he said.\n\nAttiyah's own uncle and cousin were police officers killed by IS, and he is among those hoping to identify and recover the remains of loved ones.\n\nTestimonies and witness statements, as well as findings from other mass graves in Nineveh, indicate that most of the military, police and other security forces personnel killed by IS are expected to be found at Khasfa, along with Yazidis from Sinjar and Shiite victims from Tal Afar, he said.\n\nAlaska Sen. Dan Sullivan on the Trump-Putin summit, sanctions and more\n\nLaufey on creating her own sound\n\nA robotics activist's remarkable crusade",
    "Atomic_Facts":"[\"Iraqi officials began the excavation of a suspected mass grave in al-Khafsa, south of Mosul, on August 9, 2025, at the request of Nineveh province's Governor Abdulqadir al-Dakhil.\", \"Rabah Nouri Attiyah, a lawyer, stated that Khasfa is believed to be \\\"the largest mass grave in modern Iraqi history,\\\" with approximately 70% of the remains thought to belong to Iraqi army and police personnel.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/iraq-starts-mass-grave-excavation-220303908.html",
    "Date":"2025-08-17 23:15:00",
    "News_title":"Iraq starts mass grave excavation from ISIL (ISIS) carnage south of Mosul",
    "News_text":"Iraqi officials have begun the excavation of what is believed to be a mass grave left behind byISIL (ISIS)during its years of carnage exacted upon the civilian population after it seized large swaths of the nation from 2014 onwards, until being vanquished three years later.\n\nLocal authorities were working alongside the judiciary, forensic investigators, the Iraqi Martyrs Foundation and the directorate of mass graves to carry out the excavation in al-Khafsa, south of the northern city of Mosul, the state-run Iraqi News Agency reported on Sunday.\n\nThe site – a sinkhole about 150 metres (nearly 500 feet) deep and 110 metres (360 ft) wide – is believed to have been the grisly scene of some of the worst massacres committed by ISIL.\n\nAhmad Qusay al-Asady, head of the Martyrs Foundation’s mass graves excavation department, told The Associated Press news agency that his team began work on August 9 at the request of the Nineveh province.\n\nThe operation will initially be limited to gathering visible human remains and surface evidence, while preparing for a full exhumation that officials say will require international support, al-Asady said.\n\nThe foundation will then build a database and start collecting DNA samples from families of suspected victims.\n\nFull exhumations can only proceed once specialised assistance is secured to navigate the site’s hazards, including sulfur water and unexploded ordnance. The water may have also eroded the human remains, complicating DNA identification.\n\nBecause of the presence of these elements, al-Khafsa is “a very complicated site,” al-Asady added.\n\nBased on unverified accounts from witnesses and families and other unofficial testimonies, authorities estimate the site could contain at least 4,000 remains, with the possibility of thousands more.\n\nAl-Khasfa is located nearMosul, Iraq’s second-largest city, where ISIL took control before being defeated in Iraq in late 2017. At its peak, ISIL ruled an area half the size of the United Kingdom, spanning across Iraq and Syria, with Raqqa in the latter being the capital of their self-declared “caliphate”.\n\nThe group was notorious for its brutality. The group carried out massacres ofthousands of the Yazidi peopleand enslaved thousands of Yazidi women. The Yazidis, a long-persecuted group whose faith is rooted in Zoroastrianism, are still recovering from the horrors of ISIL’s onslaught on their community in Iraq’s Sinjar district in 2014.\n\nRabah Nouri Attiyah, a lawyer who has worked on more than 70 cases of missing people in Nineveh, told the AP that information points to al-Khasfa being “the largest mass grave in modern Iraqi history”.\n\nAl-Asady, however, said investigators have not yet been able to confirm its size.\n\nAbout 70 percent of the estimated human remains there are believed to belong to Iraqi army and police personnel, as well as other victims, includingYazidis.\n\nInterviews conducted with numerous witnesses from the area suggest ISIL fighters brought people there by bus to kill them. “Many of them were decapitated,” al-Asady said.\n\nIn addition to ISIL-era mass graves, Iraqi authorities continue to unearth such sites dating to the rule of Saddam Hussein, who was toppled in a US-led invasion in 2003.",
    "Atomic_Facts":"[\"Iraqi officials began excavating a mass grave in al-Khafsa, south of Mosul, on August 9, 2025, believed to contain at least 4,000 remains from ISIL's massacres.\", \"Ahmad Qusay al-Asady, head of the Martyrs Foundation’s mass graves excavation department, stated that the site is considered “the largest mass grave in modern Iraqi history,” although its size has not yet been confirmed by investigators.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/part-rio-rancho-without-water-030627980.html",
    "Date":"2025-08-18 05:30:00",
    "News_title":"Part of Rio Rancho without water due to main break",
    "News_text":"RIO RANCHO, N.M.(KRQE) – A water main break in Rio Rancho is causing some residents to be without water for the night. A large sinkhole was spotted in front of a home on Clark Hills Drive.\n\nVIDEO: Neighbor feud ends with Rio Rancho police tasing man\n\nAround 4:30 p.m., the city posted that there is a water main break and they are actively working to fix it. The city says the estimated repair time could range from eight to 10 hours.\n\nWhile crews work to repair the water line, the city says low water pressure to no water can be expected for the area.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos.",
    "Atomic_Facts":"[\"A water main break occurred in Rio Rancho, New Mexico on August 18, 2025, causing some residents to be without water for the night, with an estimated repair time of eight to ten hours announced by the city at 4:30 p.m.\", \"A large sinkhole was observed in front of a home on Clark Hills Drive in Rio Rancho, New Mexico, as crews worked to address the water main break.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/7-foot-deep-sinkhole-shuts-235559525.html",
    "Date":"2025-08-22 00:30:00",
    "News_title":"7-foot-deep sinkhole shuts down Charleroi roadway",
    "News_text":"New photos show a massive sinkhole in the middle of Seventh Street in Charleroi — a cavity officials say is even larger than it appears in the images.\n\nThe sinkhole opened up Monday afternoon when the front tire of a tri-axle truck sank into the pavement. A tow crew pulled the vehicle out, revealing a void nearly seven feet deep.\n\nThe Charleroi Fire Department is urging drivers to avoid Seventh Street and Cherry Alley while engineers and construction crews work to determine what caused the collapse.\n\nResidents say the hole has many worried about the impact on nearby homes.\n\n“It’s kinda scary because I live right down there!” said neighbor Cindy Pagano. “I know sinkholes — we always had sinkholes in North Belle Vernon! It’s scary because, is it going to start going down toward my house? I just hope they fix it soon because there’s a lot going on in our town now.”\n\nEngineers have been using cameras and dye to investigate, but so far, no conclusive cause has been determined.\n\nRepairs will include digging up and replacing pipes, backfilling, and repaving the road — a process expected to take several weeks. More engineers are expected to come out in the coming days to continue evaluations.\n\nDownload theFREE WPXI News appfor breaking news alerts.\n\nFollow Channel 11 News onFacebookandTwitter. |Watch WPXI NOW",
    "Atomic_Facts":"[\"A sinkhole nearly seven feet deep opened on Seventh Street in Charleroi on August 21, 2025, after the front tire of a tri-axle truck sank into the pavement, prompting the Charleroi Fire Department to advise drivers to avoid the area.\", \"Repairs for the sinkhole on Seventh Street in Charleroi will involve digging up and replacing pipes, backfilling, and repaving the road, a process expected to take several weeks, according to local officials.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/army-corps-engineers-assess-former-223700870.html",
    "Date":"2025-08-22 23:30:00",
    "News_title":"Army Corps of Engineers to assess former Air Force Base infrastructure",
    "News_text":"PLATTSBURGH — The deteriorating infrastructure at the former Plattsburgh Air Force Base now has the attention of the federal government.\n\nAfter Supervisor Michael Cashman called on the federal government in June to help with the base’s worsening infrastructure, much of which is Cold-War era, U.S. Sen. Chuck Schumer, D-NY, was able to secure a meeting between Plattsburgh officials and the U.S. Army Corps of Engineers next month.\n\n“I’m grateful that the U.S. Army Corps of Engineers has agreed to come to the Town of Plattsburgh to assist local leaders in assessing the condition of the infrastructure on the footprint of the former Air Force Base,” Schumer said in a statement Thursday. “Having this discussion and getting technical and funding expertise is an important step for the Town of Plattsburgh in evaluating next steps for any eligible funding opportunities. I’ve been proud to deliver millions of federal dollars to support Plattsburgh International Airport and Clinton County and stand ready to help the town as it tackles these challenges with its inherited infrastructure through any available and eligible programs.”\n\nThe town took over the base property after it closed in 1995. Much of the infrastructure on the base was installed in the mid-1950s and state and local regulations and requirements were waived to make way for the military.\n\nThat has created an added difficulty for the town as infrastructure issues arose in recent years.\n\nCashman said during a news conference to bring attention to the base’s deterioration in June that just last year the town fixed several sinkholes that threatened utilities and disrupted activity at a costly price.\n\nHe said then that the town initially estimated the cost to repair the infrastructure damage at around $12 million but with new cracks and sinkholes continuing to appear, “the price tag is climbing every day.”\n\nIdaho Avenue, especially, is in danger. A new sinkhole opened up there a couple months ago and Cashman said by next year that section of the road may need to be torn up.\n\n“And it’s going to be another $500,000, if not more,” he said in June.\n\nCashman had asked Schumer for assistance in assessing the condition and scope of the Cold War-era infrastructure, and the senator said he worked for weeks to help get the USACE to agree to send out a team of engineers to see the site firsthand and provide technical expertise as the town evaluates next steps.\n\n“I am very appreciative that Senator Schumer has facilitated an on-the-ground meeting for the Town of Plattsburgh with the U.S. Army Corps of Engineers regarding the Former Plattsburgh Air Force Base infrastructure,” Cashman said. “Having our federal partners here to see firsthand the decaying infrastructure is a meaningful step forward. The complexities are significant, but by building confidence and working steadily with our federal partners, we can continue moving this conversation in the right direction for our community.”",
    "Atomic_Facts":"[\"U.S. Senator Chuck Schumer secured a meeting between Plattsburgh officials and the U.S. Army Corps of Engineers scheduled for September 2025 to assess the deteriorating infrastructure at the former Plattsburgh Air Force Base.\", \"Plattsburgh Supervisor Michael Cashman reported that the estimated cost to repair the infrastructure damage at the former Air Force Base has risen from $12 million to potentially over $500,000 for a new sinkhole on Idaho Avenue, which may need to be torn up by next year.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/16-mindboggling-photos-weather-scary-033101957.html",
    "Date":"2025-08-23 04:30:00",
    "News_title":"16 Incomprehensible Weather Photos That Are Freakin' Me The Heck Out",
    "News_text":"1.This hail storm in Nebraska that chipped away at this person's house. Imagine one of those golf ball-sized chunks getting hurled at you. No, thank you:\n\n2.This incredible amount of rain that fully submerged an entire hiking trail:\n\n3.This dooming sandstorm about to overtake a cargo ship:\n\nRelated:13 Tweets From Women This Week That Made Me Laugh So Hard I Might Need Medical Attention\n\n4.And this haboob that made the city it was engulfing look like a town made of miniatures:\n\n5.This area that was used to collect the sand that was displaced during Hurricane Milton. It's two palm trees high:\n\n6.This Sheeheet sinkhole, which is a terrifying reminder that the ground can just plop down right under you at any given moment:\n\nRelated:17 Wild Screenshots Of People Caught Being Extremelyyy Selfish In Public\n\n7.This 200-degree difference between two points on the same planet on the same day:\n\n8.This wind that almost blew away the poor dog trying to go potty here:\n\n9.This sunbeam that came through the window and completely melted a streak down this keyboard:\n\nRelated:25 People Share Stories Of The Most Unhinged And Uncomfortable First Dates They've Ever Been On, And I Am At A Complete Loss For Words\n\n10.This blizzard that walled in an entire plaza with snow:\n\n11.These intense storm clouds that turned a beach day into what the sky looks like when a villain approaches in a cartoon:\n\n12.This volcano that thought, \"What could make me scarier? I know! Lightning coming out of my lava hole:\"\n\n13.This incredibly trippy cloud in Indianapolis that looks like the beginning of an alien invasion:\n\nRelated:19 Absolutely Delightful Posts From This Week That Made Me Feel Like Maybe The World Isn't A Complete Dumpster Fire After All\n\n14.This hail falling...in the desert? It's incredibly satisfying seeing all of the little dimples it's leaving in the sand:\n\n15.This freaky cloud that looks like a giant ocean wave:\n\n16.Finally, this heartbreaking before-and-after that showcases the sheer power of a landslide:\n\nDo you have an absolutely wild weather photo you'd like to share? I'd like to see it! Drop it in the comments below.\n\nAlso in Internet Finds:24 Hypocrites Who Were Destroyed With A Simple \"This You?\" Comeback\n\nAlso in Internet Finds:\"My Alarm Bells Were Going Off\": People Are Sharing Their Wildest \"I F—ing Knew It\" Moments That Prove You Should ALWAYS Trust Your Gut\n\nAlso in Internet Finds:These 15 Hilarious Internet Fails From Last Week Made Me Laugh So Hard I Shed A Single Tear\n\nRead it on BuzzFeed.com",
    "Atomic_Facts":"[\"A hail storm in Nebraska recently chipped away at a person's house, with golf ball-sized chunks of hail reported during the event.\", \"A significant landslide occurred, showcasing the sheer power of the natural phenomenon, as evidenced by a heartbreaking before-and-after photo shared on August 23, 2025.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-damages-cars-near-golden-032231055.html",
    "Date":"2025-08-23 06:00:00",
    "News_title":"Sinkhole damages cars near Golden Gate Park",
    "News_text":"SAN FRANCISCO (KRON) — An unknown number of cars were damaged by a sinkhole that opened up on Lincoln Way south of Golden Gate Park on Friday evening, according to the San Francisco Fire Department.\n\nFirefighters responded to the area of Lincoln Way and 12th Avenue around 5:47 p.m. and found a 3-foot deep by 3-foot-wide sinkhole in the street. One lane of traffic remains closed on Lincoln Way while the San Francisco Department of Public Works deals with the sinkhole.\n\nWildfire spreading in Dublin\n\nSFFD said that an unknown number of cars were damaged by the sinkhole because the divers left the area before firefighters arrived.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to KRON4.",
    "Atomic_Facts":"[\"A sinkhole measuring 3 feet deep and 3 feet wide opened on Lincoln Way south of Golden Gate Park in San Francisco on August 23, 2025, damaging an unknown number of cars.\", \"Firefighters responded to the sinkhole incident at Lincoln Way and 12th Avenue at approximately 5:47 p.m. on August 23, 2025, while one lane of traffic remains closed for repairs by the San Francisco Department of Public Works.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/sinkhole-discovered-country-iantha-savannah-122122867.html",
    "Date":"2025-08-26 15:00:00",
    "News_title":"Sinkhole discovered at Country and Iantha in Savannah",
    "News_text":"SAVANNAH, Ga. (WSAV) – The Savannah Police Department (SPD) posted on itsX accountTuesday morning that a sinkhole had been discovered.\n\nThe sinkhole was discovered at the intersection of Country and Iantha just east of Skidaway Road.\n\nWSAV Traffic Page\n\nSPD asks that commuters use Sunset as an alternate route until further notice.\n\nStay with WSAV for all updates as more information is made available.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WSAV-TV.",
    "Atomic_Facts":"[\"The Savannah Police Department announced on August 26, 2025, that a sinkhole was discovered at the intersection of Country and Iantha, just east of Skidaway Road.\", \"Commuters in Savannah are advised to use Sunset as an alternate route until further notice due to the sinkhole at Country and Iantha.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/georgetown-announces-plans-city-hall-214428961.html",
    "Date":"2025-08-27 23:30:00",
    "News_title":"Georgetown announces plans for new city hall in West End community",
    "News_text":"GEORGETOWN COUNTY, S.C. (WCBD)–Georgetown city leaders announced plans Wednesday for a brand-new city hall in the heart of the West End community. The project is designed to better serve residents, meet growing demands, and provide more resources for the community.\n\nThe new facility will be located on Hazard Street inside the former Liberty Steel administrative building, which the city purchased in 2023. Renovations are expected to begin on October 1.\n\nFor nearly a decade, Georgetown City Hall has operated out of rented spaces in a former bank and housing complex. A 2011 sinkhole compromised the original building, forcing city departments to scatter across multiple locations.\n\n“We had to move out in 2016 into rented space,” Mayor Jayroe said. “We’ve been in cramped offices ever since, searching for the perfect spot to build our City Hall.”\n\nThe new building will cover 18,000 square feet, housing multiple departments, including the new City Council chambers. The design also includes two drive-thru lanes to make paying utility bills easier for residents.\n\nCity leaders emphasized that improving working conditions for staff was a top priority.\n\n“The good news is each of those department heads have been working with our design builders and project manager,” said Mayor Pro Assistant Jim Clements. “They’ve had full input. I’ll be honest, I pushed back a few times but I think everyone is happy.”\n\nOfficials say the location was chosen to strengthen connections with the West End community.\n\n“This side of Front Street is perfect,” Mayor Jayroe added. “It’s on the west end of town, which needed a little revitalization and a shot in the arm. The city believes in this area, and we are ready to mark our spot here.”\n\nCity services will continue at the current location until further notice. Officials plan to release more information in the coming weeks.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WCBD News 2.",
    "Atomic_Facts":"[\"Georgetown city leaders announced on August 27, 2025, plans for a new city hall to be located on Hazard Street inside the former Liberty Steel administrative building, with renovations expected to begin on October 1, 2025.\", \"The new city hall will cover 18,000 square feet and include multiple departments, as well as new City Council chambers and two drive-thru lanes for utility bill payments.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/local-fire-chief-addresses-lewisburg-001702399.html",
    "Date":"2025-08-28 02:30:00",
    "News_title":"Local fire chief addresses Lewisburg sinkhole situation",
    "News_text":"LEWISBURG, WV (WVNS) – A sinkhole has developed in the city of Lewisburg.\n\nThis sinkhole has popped up at the intersection of Court and Foster Streets, which are blocked off as a result.\n\nWoman charged in Greenbrier County after embezzling funds from local business\n\nJoseph Thomas is the fire chief of Lewisburg Volunteer Fire Department, which is located right down the block from the scene. He gave 59News an update on how the city of Lewisburg is approaching the situation.\n\n“The City [of Lewisburg] just wants everybody to know that, if possible, just stay away from the area. We are working on getting the problem fixed. The engineers are looking into what caused the issue right now. As soon as we can figure out what caused it and everything, they want to make sure they get the problem fixed correctly. If people just stay away for the safety of the contractors here working and yourself and avoid the area as much as possible, we would appreciate it,” said Fire Chief Thomas.\n\nFire Chief Thomas explained this is not the first time a sinkhole has developed in that proximity. The City of Lewisburg has also had to fix sinkholes in that same area at least twice in the past. Thomas told 59News they are looking at what was done in the past to more accurately fix the problem this time around.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WVNS.",
    "Atomic_Facts":"[\"A sinkhole developed at the intersection of Court and Foster Streets in Lewisburg, West Virginia, prompting the city to block off the area for safety as engineers investigate the cause on August 28, 2025.\", \"Fire Chief Joseph Thomas of the Lewisburg Volunteer Fire Department stated that this is not the first sinkhole in the area, as the City of Lewisburg has repaired similar sinkholes at least twice in the past.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/lewisburg-sinkhole-filled-intersection-court-001611907.html",
    "Date":"2025-09-05 01:30:00",
    "News_title":"Lewisburg sinkhole filled, intersection of Court and Foster Streets reopened",
    "News_text":"LEWISBURG, WV (WVNS) – The intersection of Court and Foster Streets in Lewisburg has now reopened after a sinkhole emerged, which forced a road closure.\n\nIn the process of repairing this sinkhole, workers fixed both the water line and the local PSD’s sewer line.\n\nU.S. Marshals make multiple arrests and seize drugs after Operation Rolling Waters\n\nMisty Hill is the city manager for the city of Lewisburg. She explained that the sinkhole was filled, and gravel was put down on top for the time being, as they are going to give the ground time to settle. The City is going to hold off on paving the road until after it settles.\n\n“I would just encourage everyone to take it easy. Go through slowly at the intersection with the gravel. [We] just do not want you sliding or spilling and spinning around so that other than that, we are excited to be back open,” said Hill.\n\nThat intersection will be closed again on Tuesday, September 9, 2025 for work from around 10 a.m. until 2 p.m. for work on the storm drain. Hill said this intersection in particular is one that is heavily trafficked during the Taste of Our Towns Festival which is coming up on Saturday, October 11, 2025.\n\nHill wanted to thank everyone for their patience, as well as the local Public Service District, the City’s employees, and the Lewisburg Volunteer Fire Department for all their hard work to get the sinkhole situation taken care of.\n\nCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nFor the latest news, weather, sports, and streaming video, head to WVNS.",
    "Atomic_Facts":"[\"The intersection of Court and Foster Streets in Lewisburg, West Virginia, reopened on September 5, 2025, after being closed due to a sinkhole, with temporary gravel placed on top while the ground settles.\", \"The intersection of Court and Foster Streets will be closed again on September 9, 2025, from 10 a.m. to 2 p.m. for storm drain work, coinciding with the heavily trafficked Taste of Our Towns Festival on October 11, 2025.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/five-peterborough-stories-might-missed-052228980.html",
    "Date":"2025-09-06 06:15:00",
    "News_title":"Five Peterborough stories you might have missed",
    "News_text":"The leader of Peterborough City Council resigned from the role and his party, while work began to create a new habitat for otters, water vole and wading birds at a popular country park.\n\nHere's five stories you might have missed this week in Peterborough.\n\nDennis Jones, the Labour leader of Peterborough City Council,resigned from the postand his party after messages in which he referred to victims of grooming gangs as \"poor white trash from Rotherham\".\n\nMr Jones, who will now represent Dogsthorpe ward as an independent councillor, said he \"apologised wholeheartedly for the language\" in the messages, shared by ex-Labour councillor Daisy Blakemore-Creedon.\n\nLiberal Democrat, Conservative, Green and independent group Peterborough First have urged the Labour group toreconsider its leadership of the authority.\n\nPeople in riverside flats next to a long-standing sinkhole on a footpath say they are \"delighted\"much-awaited repair works will finally begin.\n\nThe sinkhole, on Henry Penn Walk next to Peterborough's Town Bridge, was first reported in 2021 and the path has been closed amid arguments over who should be responsible for the works, which were expected to cost millions.\n\nAfter years of dispute, Riverview Housing Freehold Limited (RHFL), which includes leaseholders and freeholders of 24 flats, have agreed to pay for the repairs.\n\nWork has begun on a project torestore a flood meadowat a 2,500 acre (1,011ha) city country park.\n\nNene Park Trust has been awarded more than £64,000 for the work, which it is hoped will boost biodiversity at an overgrown site at Ferry Meadows, Peterborough.\n\nFundraising officer Louise Roe said: \"Over the years, Ham Fen has been taken over by willow and birch and we're using the funds to cut that back to create a wetland.\"\n\nIt is hoped it will attract otters, water voles and rare wetland birds.\n\nA charity that supports refugees and asylum seekers fears recent incidents of vandalism against its centrehave been targeted attacks.\n\nPeterborough Asylum and Refugee Community Association (PARCA) on Northfield Road runs a drop-in centre and offers support to migrant communities such as language classes, housing advice and children's workshops .\n\nMoez Nathu, the charity's co-founder, said garden equipment and furniture and a section of its outdoor area had been damaged during two recent incidents of vandalism.\n\nA charity supporting homeless people has said itplans to hold weekly women-only sessionsbecause vulnerable women can feel \"intimidated\" by the number of men.\n\nLight Project Peterborough (LLP) runs The Garden House in the city centre - a respite day centre for rough sleepers offering advice.\n\nThe charity said about 20% of people they supported were women, with a rise in the number of female visitors over the past two years.\n\nThe big political news this week in Peterborough was the resignation of the council's leader, Dennis Jones, from the post and the Labour party. A new leader will be elected on Friday 12th September.\n\nMeanwhile, plans for a new housing development in Thorney werewithdrawnover concerns about drainage at the proposed site. Morro Partnerships had put forward proposals to build 47 homes off Station Road.\n\nThe councilrejected plansto create a caravan site for Gypsy and traveller families in Barnack. Highways services said it had concerns over access to the site on Uffington Road.\n\nThe mayor of Cambridgeshire and Peterborough, Paul Bristow,scrapped grantsfor small businesses aimed at helping them reach net zero. And Simon Megicks, who began his career as a police officer in Cambridge in the 1990s, wasappointed chief constablefor the county after a unanimous vote by the Police and Crime Panel.\n\nPeterborough United's defence of the EFL Trophygot off to the worst possible startwith a 3-1 defeat at home against Leyton Orient on Tuesday.\n\nPosh were level just before half time through Harley Mills but conceded twice in the second half against an Orient side that was reduced to ten men in the 26th minute.\n\nDarren Ferguson's side have now failed to win any of their opening eight games.\n\nPeterborough Sportsslipped to their 5th defeatof the National League North season after a 3-2 loss against AFC Telford United on Tuesday.\n\nSports are second bottom of the table and are three points from safety with four points from seven games.\n\nFollow Peterborough news onBBC Sounds,Facebook,InstagramandX.\n\nOfficers support abuse victims with 'grab bags'\n\nHoliday photo taken 50 years ago is recreated",
    "Atomic_Facts":"[\"Dennis Jones resigned as the Labour leader of Peterborough City Council on September 6, 2025, after controversial messages he sent were made public, and he will now serve as an independent councillor representing Dogsthorpe ward.\", \"Nene Park Trust has begun a project to restore a flood meadow at Ferry Meadows, Peterborough, after receiving over £64,000 in funding, with the aim of boosting biodiversity and attracting otters, water voles, and rare wetland birds.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/lifestyle\/articles\/virginia-state-park-215-foot-014700472.html",
    "Date":"2025-09-09 03:45:00",
    "News_title":"This Virginia State Park Has A 215-Foot Natural Arch—And It’s One Of The South’s Most Iconic Landmarks",
    "News_text":"Getty Images\n\nTucked away in the mountains of Rockbridge County, Virginia, just 15 miles south ofLexington, is one of the most immediately recognizable landmarks in the South. After visitors make their way down the 137 steps from the parking lot and visitor center—a journey that is decidedly less pleasant on the way back up—they’ll get their first glimpse ofNatural Bridge, a towering structure set within a rocky gorge.\n\nSaid to be the largest limestone arch in North America, the 215-foot-tall formation was created by erosion. Arounda million years ago, a sinkhole opened, turning the Cedar Creek waterway into an underground river. The river then formed a cave that eventually collapsed; the bridge we see today is what remains of the cave ceiling.\n\nIn more recent history, the arch and the surrounding land have gone through a few different chapters. Thomas Jefferson purchased Natural Bridge in 1774, reportedly paying King George III of England20 shillings for the 157-acre tract of land. A formerly enslaved person,Patrick Henry, was then hired as the caretaker of the property and would guide people to the impressive structure.\n\nFollowing a 250-year period of private ownership—Jefferson’s estate sold it after his death—Natural Bridge State Parkwas dedicated in 2016 (but wasn’t officially owned by Virginiauntil 2023). Today, the state park welcomestens of thousandsof visitors every year. Virginians and out-of-towners alike head down those aforementioned steps in search of the iconic photo op in front of the arch, a decent hike, and all of the benefits that come with immersing yourself in natural beauty.\n\nWhile the bridge is the park’s focal point, it’s not the only piece worth seeing. There are alsoseveral miles of hiking trailsto explore, including the beloved Cedar Creek Trail. The easy 1-mile route takes hikers under the bridge—past the spot whereGeorge Washingtonallegedly carved his initials into the rock when surveying the land—and then out to Lace Falls, a 50-foot cascade. It’s also possible to arrange a shuttle down to the start of the trail and the arch. Alternatively, there’s the more moderate4-mile Blue Ridge Trail, which provides scenic mountain views. Before or after your hike, swing by the gift shop and artisan center to pick up a few souvenirs to remember your trip to this pocket of Virginia.\n\nThe park is open every day from 8 a.m. until dusk, but visitors can also time their trip to Natural Bridge with one of the various special events. In 2021, the park was recognized as anInternational Dark Sky Park, and several dark-sky programs are hosted throughout the year, includingnew moon stargazing. The monthlyIllumination of the Bridge, which takes place on the last Saturday night of each month from April through October, is another can’t-miss event—and one with roots that go back to 1927. Dozens of lights shine upon the arch, resulting in an unforgettable, ethereal scene.\n\nFall is a particularly good time to visit Natural Bridge State Park. Not only do autumnal colors blanket the region, but the cooler weather is more conducive to camping and the park’s events calendar includes several different seasonal activities. Blue Hollow Campground has three primitive campsites (read: no electric or water hookups), and reservations can be madeonline. Come October, visitors are invited to participate inHaunted History Lantern Tours,fall-themed wagon rides, and a“Things That Go Bump in the Night”guided hike.\n\nNatural Bridge, located off I-81, is a great day trip from Lexington,Roanoke, orLynchburg. Its location also makes it the perfect addition to a road trip along theBlue Ridge Parkwayor through the Shenandoah Valley. Overnight visitors can opt to stay at theNatural Bridge Historic Hotel & Conference Center, filling their itinerary with other stops in the area, like theNatural Bridge Zoo,Virginia Gold Orchard, and theVirginia Safari Park.\n\nRead the original article onSouthern Living",
    "Atomic_Facts":"[\"Natural Bridge State Park in Virginia was officially owned by the state in 2023, after a 250-year period of private ownership.\", \"In 2021, Natural Bridge State Park was recognized as an International Dark Sky Park, hosting various dark-sky programs throughout the year, including new moon stargazing.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/frustration-sinkhole-repair-works-delayed-052921315.html",
    "Date":"2025-09-09 06:00:00",
    "News_title":"Frustration as sinkhole repair works delayed again",
    "News_text":"Work to fix a sinkhole along a riverside footpath has been further delayed, leaving residents living next to it feeling \"disappointed\".\n\nThe sinkhole, on Henry Penn Walk next to Peterborough's Town Bridge, was first reported in 2021.\n\nAfter years of dispute, Riverview Housing Freehold Limited (RHFL), which includes leaseholders and freeholders of 24 flats, agreed to pay for the repairs, with work due to start last week.\n\nBut Clive Morton, one of the directors of RHFL, said the main repairs have now been \"regrettably delayed until April\", with interim work expected to begin in Autumn.\n\nPeterborough City Council said a road closure was in place for about eight weeks for the works to be carried out.\n\nMr Morton who has lived in his riverside flat for nearly a decade, said the path next to the River Nene had been deteriorating for seven years.\n\n\"We have had to delay the works very regrettably,\" he said.\n\n\"We met with our contractor last week and after discussions have been told the working conditions to carry out the repairs are not favourable due to the high water [level] in the River Nene.\n\n\"In the autumn we will do some interim works including putting in tension cables to secure the damaged wall. Once the water level has come down and the weather is suitable, main works are expected to begin in April, 2026.\n\n\"The flat owners share our disappointment. We have been waiting years for this to happen.\n\n\"Having to build up to a potential start, but face delays after you have missed the weather window is disappointing.\"\n\nVice-chair for Peterborough Civic Society, Toby Wood, said it was frustrating to hear works have been delayed again.\n\nHe said it was \"very disappointing that some of the things weren't discovered earlier\" and that he hoped it was \"a teething problem and can be sorted out soon\".\n\nPeterborough MP Andrew Pakes echoed the frustration.\n\nHe said: \"The full works have been timed out this year because they can't be completed before the weather and strength of the river changes.\n\n\"But I am pleased that work will be done to secure the area and to keep everyone safe until the main project starts in the New Year.\n\n\"We have waited long enough.\"\n\nFollow Peterborough news onBBC Sounds,Facebook,InstagramandX.\n\nWork starts on long-delayed 'eyesore' sinkhole\n\nWhy has a sinkhole not been fixed in five years?\n\nPeterborough City Council",
    "Atomic_Facts":"[\"Riverview Housing Freehold Limited announced that the main repairs for the sinkhole on Henry Penn Walk next to Peterborough's Town Bridge have been delayed until April 2026 due to unfavorable working conditions caused by high water levels in the River Nene.\", \"Interim repair work, including the installation of tension cables to secure the damaged wall, is expected to begin in Autumn 2025 as part of the ongoing efforts to address the sinkhole issue reported in 2021.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/surfside-condo-collapse-likely-began-231626903.html",
    "Date":"2025-09-09 23:45:00",
    "News_title":"Surfside condo collapse likely began on pool deck, investigators say",
    "News_text":"Sept. 9 (UPI) --A Miami area condo was showing visible signs of structural strains weeks before it collapsed and killed 98 people, federal investigators revealed Tuesday.\n\nThe update fromthe National Institute of Standards and Technology(NIST) comes four years after the catastrophiccollapse of the Champlain Towersbuilding in Surfside, Fla. The incident drew national headlines, leaving questions about what caused the 12-story building to suddenly fall apart.\n\nNIST investigators determined that the collapse likely started in the building's pool deck instead of the structure of the tower, aligning with preliminary findings into the cause of the incident. Co-lead investigator Glenn Bell said that \"it is more likely that the failure started in a pool deck slab-column connection,\" according to a news release.\n\nInvestigators used computer simulations, large-scale structural testing and signs that the building was in distress weeks before the collapse, according to the release. Those signs included a sliding glass door that had come off its frame, a horizontal crack in a planter wall and a vertical gate shifting so much that it became jammed and could not be opened.\n\nThe signs of distress were concentrated in a small area of the pool deck and the street-level parking lot, both of which began to give way at least seven minutes before the rest of the tower collapsed, the release stated. Additionally, a leak in part of the garage ceiling that was cracked had undergone many repairs and became significantly worse a day before the collapse, investigators found.\n\nInvestigators are fine-tuning their analysis of the role steel reinforcement corrosion, concrete shrinkage and shoddy construction joints in the pool deck slab had in the collapse. They intend to complete their technical work by the end of the year and draft reports on their findings. A significant update on the investigation is expected by spring 2026.\n\nPreviously, Surfside Mayor Charles W. Burkettsuggested a sinkholecaused the collapse. Lawyers for victims also argued thatconstruction on a neighboring luxurybuilding destabilized the condos.\n\nThecollapse destroyed 55 condominiumunits and left the remaining 136 units to be demolished. In 2022, a Miami Judge approveda $1 billion settlementto surviving family members, condo owners and people injured.",
    "Atomic_Facts":"[\"The National Institute of Standards and Technology announced on September 9, 2025, that the investigation into the Surfside condo collapse determined it likely began in the pool deck, specifically at a slab-column connection, rather than the tower structure itself.\", \"Investigators revealed that visible signs of distress, including a sliding glass door coming off its frame and a vertical gate becoming jammed, were present in the pool deck area at least seven minutes before the collapse of the Champlain Towers on June 24, 2021.\\n```\"]"
  },
  {
    "URL":"https:\/\/www.yahoo.com\/news\/articles\/watch-massive-sinkhole-opens-middle-133501115.html",
    "Date":"2025-09-24 14:30:00",
    "News_title":"WATCH: Massive Sinkhole Opens Up in Middle of Busy Bangkok Street",
    "News_text":"Viral footage from Bangkok,Thailand, shows an inner city intersection thrown into chaos early Wednesday as a sinkhole opened up on a major road, swallowing cars and electricity poles.\n\nThe collapse, which damaged three vehicles but caused no injuries, occurred near a hospital and directly outside a police station.\n\nOutpatient services havereportedlybeen suspended for two days, while residents in surrounding buildings were ordered to evacuate.\n\nGovernorChadchart Sittipuntconfirmed that officials believe the disaster was linked to “an ongoing construction of an underground train station.”\n\nHe insisted “relevant authorities are working to fix the hole as fast as they could” amid fears that monsoon rains could worsen the damage.\n\nMultiple clips, however, are now circulating online showing cars scrambling to reverse and pedestrians fleeing as the asphalt sank beneath them.\n\nWatch above via X.\n\nThe postWATCH: Massive Sinkhole Opens Up in Middle of Busy Bangkok Streetfirst appeared onMediaite.",
    "Atomic_Facts":"[\"A massive sinkhole opened up on September 24, 2025, at a busy intersection in Bangkok, Thailand, damaging three vehicles and prompting the suspension of outpatient services at a nearby hospital for two days.\", \"Bangkok Governor Chadchart Sittipunt confirmed that the sinkhole is believed to be linked to ongoing construction of an underground train station, with authorities working to repair the damage amid concerns about worsening conditions due to impending monsoon rains.\\n```\"]"
  }
]